[
	{
		"id": "39632e83-4d7d-4346-b333-9a4cfeb01596",
    "active": false,
		"name": "Administrador de Bancos de Dados",
		"description": "Um administrador de bancos de dados, muitas vezes chamado de DBA (Database Administrator), é um profissional responsável por gerenciar e manter bancos de dados de maneira eficiente, segura e confiável. Eles desempenham um papel fundamental na organização, armazenamento e recuperação de dados para garantir que as informações sejam acessíveis quando necessárias.",
		"roles": [
			{
				"name": "Sistemas de Gerenciamento de Conteúdo (CMS)",
				"description": "Administrar o banco de dados de um CMS usado para criar e gerenciar sites."
			},
			{
				"name": "Sistemas de Comércio Eletrônico",
				"description": "Gerenciar o banco de dados de um site de comércio eletrônico, onde são armazenadas informações de produtos, pedidos e clientes."
			},
			{
				"name": "Sistemas de Gestão de Relacionamento com o Cliente (CRM)",
				"description": "Administração de bancos de dados usados para rastrear informações de clientes, histórico de interações e atividades de vendas."
			},
			{
				"name": "Sistemas de Recursos Humanos (HRIS)",
				"description": "Administrar bancos de dados de sistemas de gestão de recursos humanos, onde são armazenadas informações de funcionários, folhas de pagamento e benefícios."
			},
			{
				"name": "Redes Sociais",
				"description": "Administração de bancos de dados em redes sociais para armazenar perfis de usuários, postagens, conexões e interações."
			}
		],
		"responsabilities": [
			{
				"name": "Configuração e Manutenção",
				"description": "Instalar, configurar e manter sistemas de gerenciamento de banco de dados (DBMS), como MySQL, Oracle, SQL Server, entre outros."
			},
			{
				"name": "Segurança de Dados",
				"description": "Implementar medidas de segurança para proteger os dados armazenados, incluindo autenticação, autorização e criptografia."
			},
			{
				"name": "Backup e Recuperação",
				"description": "Realizar backups regulares dos bancos de dados para garantir a recuperação de dados em caso de falhas ou desastres."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Monitorar o desempenho dos bancos de dados, identificar gargalos e otimizar consultas para melhorar a eficiência."
			},
			{
				"name": "Documentação",
				"description": "Manter documentação precisa dos bancos de dados, incluindo esquemas, políticas de segurança e procedimentos de backup."
			}
		],
		"companies": [
			{
				"name": "Oracle Corporation",
				"description": "A Oracle é uma das maiores empresas de tecnologia do mundo, conhecida por seus sistemas de gerenciamento de banco de dados, incluindo o Oracle Database."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft é uma líder em software empresarial, com produtos como o SQL Server, que requerem administradores de bancos de dados para gerenciar sistemas de banco de dados."
			},
			{
				"name": "Amazon Web Services (AWS)",
				"description": "A AWS é a principal plataforma de serviços em nuvem, oferecendo uma variedade de serviços de banco de dados gerenciados que precisam de administração por DBAs."
			},
			{
				"name": "Redis Labs",
				"description": "A Redis Labs é conhecida por seu banco de dados NoSQL Redis e oferece oportunidades para administradores de banco de dados que trabalham com essa tecnologia."
			},
			{
				"name": "Google Cloud",
				"description": "O Google Cloud Platform (GCP) oferece serviços de banco de dados em nuvem, como o Google Cloud SQL, que requerem administração por profissionais de bancos de dados."
			}
		],
		"params": {
			"high_level_coding": 5,
			"low_level_coding": 5,
			"backend": 7,
			"frontend": 1,
			"databases": 10,
			"data_structures": 8,
			"algorithms": 6,
			"hardware": 4,
			"software": 8,
			"infrastructure": 8,
			"design": 1,
			"ui_ux": 0,
			"mobile": 3,
			"desktop": 7,
			"web": 5,
			"tangible_results": 2,
			"abstract_results": 8,
			"theory": 6,
			"practice": 9,
			"curiosity": 5,
			"practicality": 9,
			"creativity": 5,
			"logic": 9,
			"intuition": 5,
			"experimentation": 8,
			"methodology": 7,
			"analysis": 9,
			"adaptability": 8,
			"leadership": 2,
			"communication": 4,
			"team_work": 4,
			"individual_work": 8,
			"management": 1,
			"business": 4,
			"finance": 0,
			"math": 4,
			"physics": 0,
			"chemistry": 0,
			"teaching": 2,
			"mentoring": 3,
			"masters_degree": 6,
			"doctorate_degree": 6,
			"internship": 3,
			"apprenticeship": 2,
			"hiring_potential": 7
		}
	},
	{
		"id": "30875895-1812-42c4-9935-4cab890ebe6f",
    "active": true,
		"name": "Administrador de Sistemas",
		"description": "Um administrador de sistemas, também conhecido como administrador de redes ou administrador de TI, é um profissional responsável por gerenciar e manter a infraestrutura de tecnologia da informação (TI) de uma organização. O papel do administrador de sistemas é garantir que os sistemas de computadores, servidores, redes e serviços funcionem de forma eficiente, segura e confiável para atender às necessidades da empresa. Eles desempenham um papel fundamental na manutenção da integridade e disponibilidade dos recursos de TI, além de implementar medidas de segurança e solucionar problemas técnicos.",
		"roles": [
			{
				"name": "Implantação de Servidores",
				"description": "Configurar e implantar servidores para hospedar sites, aplicativos ou serviços internos da empresa."
			},
			{
				"name": "Upgrade de Infraestrutura",
				"description": "Atualizar a infraestrutura de TI, substituindo hardware mais antigo e sistemas obsoletos por soluções mais modernas e eficientes."
			},
			{
				"name": "Reforço de Segurança",
				"description": "Implementar medidas de segurança adicionais, como firewalls de próxima geração, detecção de intrusões e análise de segurança."
			},
			{
				"name": "Recuperação de Desastres",
				"description": "Desenvolver e testar planos de recuperação de desastres para garantir a continuidade dos negócios em caso de falhas catastróficas."
			},
			{
				"name": "Automatização de Rotinas",
				"description": "Automatizar tarefas de rotina, como backups e provisionamento de usuários, para economizar tempo e recursos."
			}
		],
		"responsabilities": [
			{
				"name": "Instalação e Configuração",
				"description": "Implantar e configurar sistemas operacionais, aplicativos e serviços nos servidores e computadores da empresa."
			},
			{
				"name": "Monitoramento e Manutenção",
				"description": "Monitorar continuamente a infraestrutura de TI para identificar e resolver problemas de desempenho, falhas e interrupções."
			},
			{
				"name": "Segurança de TI",
				"description": "Implementar medidas de segurança, como firewalls, antivírus, autenticação e controle de acesso, para proteger os sistemas e dados da organização contra ameaças cibernéticas."
			},
			{
				"name": "Backup e Recuperação",
				"description": "Realizar backups regulares de dados e sistemas e desenvolver planos de recuperação de desastres para garantir a disponibilidade de dados críticos em caso de falha."
			},
			{
				"name": "Atualizações e Patches",
				"description": "Aplicar atualizações de software, patches de segurança e correções de vulnerabilidades para manter os sistemas atualizados e seguros."
			}
		],
		"companies": [
			{
				"name": "IBM",
				"description": "A IBM é uma das maiores empresas de tecnologia do mundo, oferecendo uma ampla gama de serviços de TI, incluindo administração de sistemas e consultoria."
			},
			{
				"name": "Oracle",
				"description": "A Oracle é conhecida por seus sistemas de banco de dados e soluções empresariais, e muitos administradores de sistemas se especializam em suas tecnologias."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft fornece soluções de TI, sistemas operacionais e serviços em nuvem, com muitos profissionais de administração de sistemas especializados em suas tecnologias."
			},
			{
				"name": "Amazon Web Services (AWS)",
				"description": "A AWS é uma das principais provedoras de serviços em nuvem do mundo, com uma crescente demanda por administradores de sistemas especializados em cloud computing."
			},
			{
				"name": "Google Cloud",
				"description": "A divisão de computação em nuvem do Google oferece serviços e soluções de TI baseados em nuvem, atraindo profissionais de administração de sistemas."
			}
		],
		"params": {
			"high_level_coding": 3,
			"low_level_coding": 8,
			"backend": 6,
			"frontend": 1,
			"databases": 8,
			"data_structures": 7,
			"algorithms": 5,
			"hardware": 4,
			"software": 8,
			"infrastructure": 8,
			"design": 1,
			"ui_ux": 0,
			"mobile": 3,
			"desktop": 6,
			"web": 5,
			"tangible_results": 2,
			"abstract_results": 9,
			"theory": 8,
			"practice": 7,
			"curiosity": 6,
			"practicality": 7,
			"creativity": 6,
			"logic": 7,
			"intuition": 4,
			"experimentation": 8,
			"methodology": 8,
			"analysis": 9,
			"adaptability": 9,
			"leadership": 2,
			"communication": 4,
			"team_work": 3,
			"individual_work": 9,
			"management": 1,
			"business": 4,
			"finance": 0,
			"math": 5,
			"physics": 0,
			"chemistry": 0,
			"teaching": 2,
			"mentoring": 3,
			"masters_degree": 7,
			"doctorate_degree": 8,
			"internship": 4,
			"apprenticeship": 2,
			"hiring_potential": 7
		}
	},
	{
		"id": "02f2284e-ef9b-4c0a-965b-3b25e93d35b3",
    "active": false,
		"name": "Analista de Segurança de Software",
		"description": "Um analista de segurança de software é um profissional especializado em proteger sistemas de software contra ameaças cibernéticas e garantir que eles sejam seguros contra vulnerabilidades e ataques. Eles desempenham um papel crucial na proteção de dados confidenciais e na prevenção de danos a sistemas e informações.",
		"roles": [
			{
				"name": "Teste de Segurança de Aplicativos",
				"description": "Realizar testes de segurança em aplicativos da web, móveis e desktop para identificar vulnerabilidades e garantir que eles sejam resistentes a ataques."
			},
			{
				"name": "Avaliação de Infraestrutura de Segurança",
				"description": "Analisar a infraestrutura de TI de uma organização para identificar pontos fracos em firewalls, servidores, redes e sistemas de armazenamento."
			},
			{
				"name": "Auditoria de Conformidade",
				"description": "Avaliar se as práticas de segurança de software estão em conformidade com regulamentações e padrões de segurança, como o GDPR ou PCI DSS."
			},
			{
				"name": "Testes de Penetração em Redes",
				"description": "Realizar testes de penetração em redes corporativas para identificar vulnerabilidades e pontos de entrada para potenciais invasores."
			},
			{
				"name": "Treinamento de Equipe",
				"description": "Treinar equipes de TI e funcionários para adotarem boas práticas de segurança de software."
			}
		],
		"responsabilities": [
			{
				"name": "Análise de Vulnerabilidades",
				"description": "Identificar e avaliar vulnerabilidades em software, incluindo aplicativos, sistemas operacionais e infraestrutura de TI."
			},
			{
				"name": "Testes de Penetração",
				"description": "Realizar testes de penetração para simular ataques cibernéticos e descobrir falhas de segurança."
			},
			{
				"name": "Monitoramento de Segurança",
				"description": "Monitorar continuamente sistemas e redes em busca de atividades suspeitas ou intrusões."
			},
			{
				"name": "Políticas de Segurança",
				"description": "Desenvolver políticas de segurança de software e garantir que todos na organização as sigam."
			},
			{
				"name": "Treinamento e Conscientização",
				"description": "Treinar funcionários sobre práticas seguras de TI e conscientizá-los sobre ameaças cibernéticas."
			}
		],
		"companies": [
			{
				"name": "Symantec",
				"description": "A Symantec é conhecida por seus produtos de segurança, incluindo antivírus e soluções de segurança empresarial."
			},
			{
				"name": "McAfee",
				"description": "A McAfee oferece uma ampla gama de soluções de segurança cibernética, incluindo software antivírus e de segurança de rede."
			},
			{
				"name": "FireEye",
				"description": "A FireEye é uma empresa especializada em segurança cibernética que fornece soluções de detecção e resposta a ameaças avançadas."
			},
			{
				"name": "Fortinet",
				"description": "A Fortinet é conhecida por seus produtos de segurança de rede, incluindo firewalls e soluções de segurança de acesso à rede."
			},
			{
				"name": "IBM Security",
				"description": "A IBM oferece uma ampla gama de soluções de segurança cibernética, incluindo análise de segurança e serviços de resposta a incidentes."
			}
		],
		"params": {
			"high_level_coding": 3,
			"low_level_coding": 4,
			"backend": 6,
			"frontend": 6,
			"databases": 6,
			"data_structures": 6,
			"algorithms": 9,
			"hardware": 6,
			"software": 8,
			"infrastructure": 8,
			"design": 6,
			"ui_ux": 0,
			"mobile": 6,
			"desktop": 6,
			"web": 6,
			"tangible_results": 4,
			"abstract_results": 7,
			"theory": 9,
			"practice": 6,
			"curiosity": 8,
			"practicality": 5,
			"creativity": 7,
			"logic": 9,
			"intuition": 9,
			"experimentation": 10,
			"methodology": 8,
			"analysis": 10,
			"adaptability": 9,
			"leadership": 5,
			"communication": 8,
			"team_work": 6,
			"individual_work": 6,
			"management": 4,
			"business": 5,
			"finance": 3,
			"math": 5,
			"physics": 0,
			"chemistry": 0,
			"teaching": 8,
			"mentoring": 4,
			"masters_degree": 9,
			"doctorate_degree": 9,
			"internship": 3,
			"apprenticeship": 4,
			"hiring_potential": 6
		}
	},
	{
		"id": "a5e524d7-c7fe-4373-a4a8-949e8030b87e",
    "active": false,
		"name": "Arquiteto de Hardware",
		"description": "Um Arquiteto de Hardware é um profissional que projeta e planeja os componentes físicos de dispositivos eletrônicos, como computadores, smartphones, tablets, sistemas embarcados e outros dispositivos eletrônicos. Eles são responsáveis por determinar como os diferentes componentes de hardware de um dispositivo se comunicam entre si e como funcionarão em conjunto para executar as funções desejadas.",
		"roles": [
			{
				"name": "Desenvolvimento de Computadores",
				"description": "Projetar os componentes internos de um computador, como a placa-mãe, processador, memória RAM e placas de vídeo."
			},
			{
				"name": "Design de Smartphones",
				"description": "Criar a estrutura interna e os circuitos de um smartphone, incluindo a integração de câmeras, sensores e telas sensíveis ao toque."
			},
			{
				"name": "Sistemas Embarcados",
				"description": "Desenvolver hardware para sistemas embarcados em dispositivos como sistemas de controle de automóveis, eletrodomésticos inteligentes e drones."
			},
			{
				"name": "Eletrônica de Consumo",
				"description": "Desenvolver eletrônicos de consumo, como TVs, consoles de videogame, áudio e vídeo de alta qualidade."
			},
			{
				"name": "Robótica",
				"description": "Projetar o hardware necessário para robôs autônomos ou controlados remotamente, como robôs industriais e robôs de exploração."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Circuitos",
				"description": "Desenvolver os circuitos eletrônicos que compõem um dispositivo, incluindo microprocessadores, memória, sensores e interfaces de comunicação."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Garantir que o hardware funcione de maneira eficiente e atenda aos requisitos de desempenho estabelecidos."
			},
			{
				"name": "Teste e Depuração",
				"description": "Realizar testes para identificar problemas e garantir que o hardware funcione corretamente."
			},
			{
				"name": "Acompanhamento de Tecnologias Emergentes",
				"description": "Manter-se atualizado sobre as últimas tendências e avanços em tecnologia de hardware para aplicá-los em projetos futuros."
			}
		],
		"companies": [
			{
				"name": "Intel Corporation",
				"description": "Uma das maiores empresas de semicondutores do mundo, conhecida por projetar e fabricar microprocessadores."
			},
			{
				"name": "NVIDIA",
				"description": "Especializada em unidades de processamento gráfico (GPUs) e hardware relacionado para gráficos e computação de alta performance."
			},
			{
				"name": "Apple Inc.",
				"description": "A gigante de tecnologia que produz uma variedade de dispositivos eletrônicos, incluindo iPhones, iPads e Macs."
			},
			{
				"name": "Tesla",
				"description": "Fabricante de veículos elétricos, onde os Arquitetos de Hardware desempenham um papel importante no desenvolvimento de sistemas de veículos autônomos."
			},
			{
				"name": "Micron Technology",
				"description": "Fabricante de memória e soluções de armazenamento, com foco em tecnologia de semicondutores."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 5,
			"backend": 4,
			"frontend": 1,
			"databases": 4,
			"data_structures": 7,
			"algorithms": 8,
			"hardware": 10,
			"software": 4,
			"infrastructure": 7,
			"design": 1,
			"ui_ux": 0,
			"mobile": 7,
			"desktop": 8,
			"web": 1,
			"tangible_results": 9,
			"abstract_results": 6,
			"theory": 9,
			"practice": 6,
			"curiosity": 8,
			"practicality": 6,
			"creativity": 7,
			"logic": 10,
			"intuition": 4,
			"experimentation": 8,
			"methodology": 8,
			"analysis": 9,
			"adaptability": 9,
			"leadership": 1,
			"communication": 4,
			"team_work": 6,
			"individual_work": 8,
			"management": 1,
			"business": 0,
			"finance": 0,
			"math": 9,
			"physics": 9,
			"chemistry": 6,
			"teaching": 1,
			"mentoring": 6,
			"masters_degree": 10,
			"doctorate_degree": 9,
			"internship": 3,
			"apprenticeship": 4,
			"hiring_potential": 6
		}
	},
	{
		"id": "362a28fd-dc0f-4261-b0b5-29846fa9ac88",
    "active": false,
		"name": "Arquiteto/Engenheiro Cloud",
		"description": "Um arquiteto ou engenheiro cloud é um profissional especializado em projetar, implementar e gerenciar soluções de computação em nuvem para empresas e organizações. Sua principal responsabilidade é ajudar as empresas a migrar para a nuvem, otimizar suas operações e garantir que os recursos em nuvem atendam às necessidades de negócios.",
		"roles": [
			{
				"name": "Desenvolvimento de Aplicativos em Nuvem",
				"description": "Projetar e implementar aplicativos nativos em nuvem que sejam escaláveis e acessíveis de qualquer lugar."
			},
			{
				"name": "Hospedagem de Sites e Aplicativos em Nuvem",
				"description": "Hospedar sites, aplicativos da web e lojas online em serviços em nuvem para escalabilidade e confiabilidade."
			},
			{
				"name": "Big Data e Análise em Nuvem",
				"description": "Criar ambientes em nuvem para armazenar, processar e analisar grandes volumes de dados."
			},
			{
				"name": "IoT (Internet das Coisas) em Nuvem",
				"description": "Configurar infraestruturas em nuvem para receber, armazenar e analisar dados de dispositivos IoT."
			},
			{
				"name": "Recuperação de Desastres em Nuvem",
				"description": "Configurar soluções de recuperação de desastres em nuvem para garantir a continuidade dos negócios em caso de falhas."
			}
		],
		"responsabilities": [
			{
				"name": "Design de Arquitetura em Nuvem",
				"description": "Planejar e projetar a arquitetura de sistemas e aplicativos em nuvem, determinando quais serviços em nuvem são necessários."
			},
			{
				"name": "Implementação de Soluções em Nuvem",
				"description": "Configurar e implementar soluções em nuvem, incluindo a criação de ambientes virtuais e redes."
			},
			{
				"name": "Migração para a Nuvem",
				"description": "Auxiliar na migração de sistemas e dados de ambientes locais para a nuvem."
			},
			{
				"name": "Treinamento e Consultoria",
				"description": "Treinar a equipe da empresa e fornecer consultoria sobre melhores práticas em nuvem."
			},
			{
				"name": "Integração de Sistemas",
				"description": "Integrar sistemas e aplicativos em nuvem com sistemas existentes da empresa."
			}
		],
		"companies": [
			{
				"name": "Amazon Web Services (AWS)",
				"description": "A AWS é uma das maiores e mais conhecidas plataformas de serviços em nuvem, oferecendo uma ampla gama de serviços e soluções em nuvem."
			},
			{
				"name": "Microsoft Azure",
				"description": "A Microsoft Azure é uma plataforma de nuvem amplamente utilizada que oferece serviços de infraestrutura, desenvolvimento, análise e mais."
			},
			{
				"name": "Google Cloud Platform (GCP)",
				"description": "A GCP é a plataforma de nuvem do Google, oferecendo serviços de computação em nuvem, armazenamento de dados, aprendizado de máquina e mais."
			},
			{
				"name": "IBM Cloud",
				"description": "A IBM Cloud oferece uma variedade de serviços em nuvem, incluindo soluções de IA, blockchain, análise e mais."
			},
			{
				"name": "Oracle Cloud",
				"description": "A Oracle Cloud oferece serviços em nuvem, incluindo banco de dados em nuvem, aplicativos em nuvem e infraestrutura em nuvem."
			}
		],
		"params": {
			"high_level_coding": 5,
			"low_level_coding": 7,
			"backend": 9,
			"frontend": 4,
			"databases": 8,
			"data_structures": 7,
			"algorithms": 8,
			"hardware": 3,
			"software": 9,
			"infrastructure": 6,
			"design": 5,
			"ui_ux": 0,
			"mobile": 4,
			"desktop": 6,
			"web": 7,
			"tangible_results": 2,
			"abstract_results": 8,
			"theory": 6,
			"practice": 9,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 8,
			"intuition": 5,
			"experimentation": 7,
			"methodology": 7,
			"analysis": 6,
			"adaptability": 8,
			"leadership": 2,
			"communication": 6,
			"team_work": 7,
			"individual_work": 7,
			"management": 3,
			"business": 2,
			"finance": 0,
			"math": 5,
			"physics": 1,
			"chemistry": 0,
			"teaching": 5,
			"mentoring": 4,
			"masters_degree": 6,
			"doctorate_degree": 4,
			"internship": 8,
			"apprenticeship": 7,
			"hiring_potential": 8
		}
	},
	{
		"id": "5d6e05dc-2747-4bd3-9de1-89ad1c1d56fb",
    "active": true,
		"name": "Cientista de Dados",
		"description": "Um cientista de dados é um profissional especializado em coletar, analisar e interpretar grandes volumes de dados para obter insights valiosos que ajudem as empresas a tomar decisões informadas. Eles desempenham um papel crucial na extração de conhecimento a partir de dados brutos e na transformação desses insights em ações estratégicas.",
		"roles": [
			{
				"name": "Previsão de Demanda",
				"description": "Utilizar dados históricos de vendas para prever a demanda futura de produtos, permitindo um planejamento de estoque mais eficiente."
			},
			{
				"name": "Análise de Churn de Clientes",
				"description": "Analisar dados de clientes para identificar os fatores que contribuem para a perda de clientes (churn) e desenvolver estratégias de retenção."
			},
			{
				"name": "Análise Financeira",
				"description": "Avaliar dados financeiros para identificar tendências de mercado, riscos de investimento e oportunidades de negócios."
			},
			{
				"name": "Agricultura de Precisão",
				"description": "Coletar dados de sensores e imagens de satélite para otimizar práticas agrícolas, como irrigação e cultivo."
			},
			{
				"name": "Transporte e Logística",
				"description": "Analisar dados de GPS e logística para otimizar rotas de entrega e gerenciar frotas de veículos."
			}
		],
		"responsabilities": [
			{
				"name": "Coleta de Dados",
				"description": "Coletar dados de diversas fontes, como bancos de dados, sensores, redes sociais e outras fontes digitais."
			},
			{
				"name": "Limpeza e Preparação de Dados",
				"description": "Limpar, organizar e preparar os dados para análise, garantindo que estejam livres de erros e prontos para uso."
			},
			{
				"name": "Análise de Dados",
				"description": "Aplicar técnicas estatísticas, algoritmos de aprendizado de máquina e mineração de dados para encontrar padrões, tendências e insights nos dados."
			},
			{
				"name": "Inteligência de Negócios",
				"description": "Fornecer informações estratégicas para apoiar decisões de negócios, identificar oportunidades e otimizar processos."
			},
			{
				"name": "Segurança de Dados",
				"description": "Garantir a segurança e a privacidade dos dados, aderindo às regulamentações relevantes."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "A Google é uma das maiores empresas de tecnologia do mundo e utiliza cientistas de dados para aprimorar seus produtos e serviços, bem como para pesquisa em aprendizado de máquina."
			},
			{
				"name": "Meta",
				"description": "A Meta, com o Facebook, Instagram e WhatsApp, emprega cientistas de dados para análise de dados de usuários e otimização de publicidade direcionada."
			},
			{
				"name": "Amazon",
				"description": "A Amazon utiliza cientistas de dados para melhorar sua logística, personalizar recomendações de produtos e otimizar a experiência do cliente."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft emprega cientistas de dados em várias áreas, incluindo pesquisa em inteligência artificial, análise de negócios e desenvolvimento de produtos."
			},
			{
				"name": "Netflix",
				"description": "A Netflix utiliza cientistas de dados para personalizar recomendações de conteúdo e melhorar a experiência do usuário em sua plataforma de streaming."
			}
		],
		"params": {
			"high_level_coding": 2,
			"low_level_coding": 3,
			"backend": 6,
			"frontend": 3,
			"databases": 8,
			"data_structures": 8,
			"algorithms": 6,
			"hardware": 3,
			"software": 6,
			"infrastructure": 5,
			"design": 9,
			"ui_ux": 0,
			"mobile": 6,
			"desktop": 6,
			"web": 7,
			"tangible_results": 4,
			"abstract_results": 7,
			"theory": 8,
			"practice": 10,
			"curiosity": 8,
			"practicality": 5,
			"creativity": 6,
			"logic": 8,
			"intuition": 8,
			"experimentation": 9,
			"methodology": 8,
			"analysis": 10,
			"adaptability": 8,
			"leadership": 3,
			"communication": 8,
			"team_work": 5,
			"individual_work": 8,
			"management": 5,
			"business": 6,
			"finance": 4,
			"math": 8,
			"physics": 2,
			"chemistry": 1,
			"teaching": 8,
			"mentoring": 5,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 6,
			"apprenticeship": 5,
			"hiring_potential": 8
		}
	},
	{
		"id": "af0d9260-0f13-49c1-b84d-3efbdde790cc",
    "active": true,
		"name": "Desenvolvedor Backend Desktop",
		"description": "Um desenvolvedor backend para desktop é um profissional de tecnologia da informação que se concentra em criar a parte \"invisível\" de um software de desktop. Eles são responsáveis por desenvolver o código e a lógica que controlam o funcionamento do software e garantem que ele funcione corretamente nos computadores dos usuários. O trabalho de um desenvolvedor backend para desktop está intimamente relacionado à programação e envolve a criação de aplicativos de desktop robustos e eficientes.",
		"courses": [
      {
        "id": "3d8fe4d4-64be-4466-b5b7-6f4b1a6a8909",
        "active": false,
        "importance": 10
      },
      {
        "id": "cd8a0db4-4d0a-424e-9e80-6f5827946c63",
        "active": false,
        "importance": 10
      },
      {
        "id": "17706ab4-5178-4e9f-997e-75abb55a6161",
        "active": false,
        "importance": 10
      },
      {
        "id": "a164869d-98fd-402c-b325-5c59c1849578",
        "active": false,
        "importance": 10
      },
      {
        "id": "b0ba9ec1-e63c-4749-8e29-4e863605badb",
        "active": false,
        "importance": 10
      }
    ],
    "roles": [
			{
				"name": "Desenvolvimento de Aplicativos Empresariais",
				"description": "Criar sistemas de software de desktop para empresas que ajudem a gerenciar processos internos, como contabilidade, recursos humanos e gestão de estoque."
			},
			{
				"name": "Software de Design Gráfico",
				"description": "Desenvolver aplicativos de desktop usados por designers gráficos para criar gráficos, ilustrações e layouts."
			},
			{
				"name": "Sistemas de Gerenciamento de Banco de Dados",
				"description": "Desenvolver sistemas de gerenciamento de banco de dados de desktop para empresas que precisam armazenar e acessar grandes volumes de informações."
			},
			{
				"name": "Aplicativos de Edição de Vídeo e Áudio",
				"description": "Criar software de desktop usado para edição de vídeo, áudio e produção multimídia."
			},
			{
				"name": "Ferramentas de Automação de Escritório",
				"description": "Desenvolver ferramentas de automação de escritório para otimizar tarefas repetitivas, como geração de relatórios ou análise de dados."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento de Lógica",
				"description": "Criar a lógica do software que permite que ele realize tarefas específicas, como processamento de dados, cálculos complexos ou interações com bancos de dados."
			},
			{
				"name": "Integração de Dados",
				"description": "Integrar o software com bancos de dados e sistemas de armazenamento para que os usuários possam acessar, inserir e modificar informações."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Otimizar o código para garantir que o software seja rápido e eficiente, minimizando a utilização de recursos do computador."
			},
			{
				"name": "Testes e Depuração",
				"description": "Realizar testes rigorosos para garantir que o software funcione sem problemas e depurar problemas que possam surgir."
			},
			{
				"name": "Correção de Bugs",
				"description": "Identificar e corrigir erros ou problemas no software para garantir que ele funcione corretamente."
			}
		],
		"companies": [
			{
				"name": "Microsoft",
				"description": "Uma das maiores empresas de tecnologia do mundo, a Microsoft desenvolve sistemas operacionais e software para desktop, constantemente procurando desenvolvedores para suas equipes de engenharia."
			},
			{
				"name": "Apple",
				"description": "A Apple é conhecida por seus produtos de desktop, como o Mac, e contrata desenvolvedores para trabalhar em seus sistemas operacionais e aplicativos."
			},
			{
				"name": "Google",
				"description": "Embora mais focado em tecnologias web e mobile, o Google também tem projetos de desktop, como o Chrome OS, que requerem desenvolvedores."
			},
			{
				"name": "Oracle",
				"description": "A Oracle é conhecida por seus sistemas de gerenciamento de banco de dados e softwares empresariais, que frequentemente têm componentes de desktop."
			},
			{
				"name": "Adobe",
				"description": "A Adobe é famosa por seus aplicativos de desktop, como o Adobe Photoshop e o Adobe Acrobat, e emprega desenvolvedores para aprimorar essas ferramentas."
			}
		],
		"params": {
			"high_level_coding": 3,
			"low_level_coding": 9,
			"backend": 10,
			"frontend": 3,
			"databases": 8,
			"data_structures": 9,
			"algorithms": 8,
			"hardware": 2,
			"software": 10,
			"infrastructure": 6,
			"design": 3,
			"ui_ux": 1,
			"mobile": 5,
			"desktop": 10,
			"web": 3,
			"tangible_results": 2,
			"abstract_results": 10,
			"theory": 5,
			"practice": 9,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 8,
			"intuition": 6,
			"experimentation": 5,
			"methodology": 8,
			"analysis": 5,
			"adaptability": 6,
			"leadership": 3,
			"communication": 6,
			"team_work": 9,
			"individual_work": 6,
			"management": 3,
			"business": 4,
			"finance": 4,
			"math": 6,
			"physics": 2,
			"chemistry": 1,
			"teaching": 5,
			"mentoring": 6,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 8,
			"apprenticeship": 7,
			"hiring_potential": 8
		}
	},
	{
		"id": "d8f59941-1ee4-4161-98a1-9047bb9700f1",
    "active": true,
		"name": "Desenvolvedor Backend Mobile",
		"description": "Um desenvolvedor backend para mobile é um profissional de tecnologia que desempenha um papel fundamental no desenvolvimento de aplicativos móveis. Sua principal responsabilidade é criar e manter a infraestrutura que permite que os aplicativos móveis funcionem de maneira eficiente e se conectem a servidores e bancos de dados.",
		"roles": [
			{
				"name": "Aplicativos de Redes Sociais",
				"description": "Desenvolver a infraestrutura de backend para aplicativos de redes sociais, permitindo que os usuários compartilhem conteúdo, se conectem com amigos e acessem feeds de notícias."
			},
			{
				"name": "Aplicativos de Comércio Eletrônico",
				"description": "Criar sistemas backend para aplicativos de compras online, gerenciando catálogos de produtos, carrinhos de compras e processamento de pedidos."
			},
			{
				"name": "Aplicativos de Streaming de Mídia",
				"description": "Desenvolver serviços de streaming de áudio e vídeo para aplicativos de entretenimento, como Spotify e Netflix."
			},
			{
				"name": "Aplicativos de Finanças",
				"description": "Desenvolver serviços de backend seguros para aplicativos bancários móveis, permitindo transações financeiras e gerenciamento de contas."
			},
			{
				"name": "Aplicativos de Produtividade",
				"description": "Criar serviços de sincronização de dados e colaboração em equipe para aplicativos de produtividade móvel, como aplicativos de notas e gerenciadores de tarefas."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento de Serviços Web",
				"description": "Os desenvolvedores backend para mobile criam os serviços web e APIs (interfaces de programação de aplicativos) necessários para que os aplicativos móveis obtenham e enviem dados do servidor."
			},
			{
				"name": "Gerenciamento de Dados",
				"description": "Eles lidam com o armazenamento e a recuperação de dados, garantindo que os aplicativos móveis tenham acesso a informações atualizadas e relevantes."
			},
			{
				"name": "Integração de Terceiros",
				"description": "Integram serviços de terceiros, como redes sociais ou sistemas de pagamento, nos aplicativos móveis."
			},
			{
				"name": "Escalabilidade",
				"description": "Planejam e implementam a escalabilidade dos sistemas para lidar com um grande número de usuários e picos de tráfego."
			},
			{
				"name": "Atualizações e Manutenção",
				"description": "Fornecem atualizações regulares e manutenção contínua para garantir que os aplicativos permaneçam funcionais e seguros."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "A Google oferece serviços como o Firebase, que inclui uma variedade de ferramentas de backend para aplicativos móveis, como armazenamento em nuvem, autenticação e análise."
			},
			{
				"name": "Amazon Web Services (AWS)",
				"description": "A AWS fornece uma ampla gama de serviços em nuvem que são amplamente utilizados no desenvolvimento backend de aplicativos móveis, incluindo AWS Lambda, Amazon S3 e Amazon API Gateway."
			},
			{
				"name": "Microsoft Azure",
				"description": "A Microsoft Azure oferece soluções de backend para aplicativos móveis, como Azure Functions, Azure Mobile Apps e Azure Cosmos DB."
			},
			{
				"name": "Oracle Cloud",
				"description": "A Oracle oferece serviços em nuvem para desenvolvimento de aplicativos móveis, incluindo Oracle Mobile Cloud Service (MCS) e Oracle Database Cloud."
			},
			{
				"name": "Red Hat",
				"description": "A Red Hat oferece soluções de código aberto para desenvolvimento de aplicativos móveis, incluindo Red Hat Mobile Application Platform."
			}
		],
		"params": {
			"high_level_coding": 5,
			"low_level_coding": 9,
			"backend": 10,
			"frontend": 4,
			"databases": 8,
			"data_structures": 8,
			"algorithms": 8,
			"hardware": 2,
			"software": 9,
			"infrastructure": 3,
			"design": 2,
			"ui_ux": 1,
			"mobile": 9,
			"desktop": 5,
			"web": 4,
			"tangible_results": 2,
			"abstract_results": 9,
			"theory": 6,
			"practice": 9,
			"curiosity": 8,
			"practicality": 8,
			"creativity": 7,
			"logic": 7,
			"intuition": 6,
			"experimentation": 5,
			"methodology": 8,
			"analysis": 6,
			"adaptability": 8,
			"leadership": 3,
			"communication": 6,
			"team_work": 9,
			"individual_work": 5,
			"management": 5,
			"business": 4,
			"finance": 3,
			"math": 4,
			"physics": 0,
			"chemistry": 0,
			"teaching": 3,
			"mentoring": 4,
			"masters_degree": 5,
			"doctorate_degree": 4,
			"internship": 6,
			"apprenticeship": 6,
			"hiring_potential": 8
		}
	},
	{
		"id": "e323403c-a3b5-4480-ad7c-4a030fa9006d",
    "active": true,
		"name": "Desenvolvedor Backend Web",
		"description": "Um desenvolvedor backend para web é um profissional de tecnologia da informação responsável por criar e manter a parte \"invisível\" dos sites e aplicativos web. Enquanto os desenvolvedores de frontend se concentram na parte visual e interativa que os usuários veem e interagem, os desenvolvedores backend trabalham nos bastidores, lidando com o processamento de dados, o armazenamento em bancos de dados, a lógica do servidor e a segurança. Sua principal função é garantir que um site ou aplicativo funcione de maneira eficiente e segura, processando solicitações dos usuários e entregando conteúdo dinâmico.",
		"roles": [
			{
				"name": "Plataforma de Comércio Eletrônico",
				"description": "Em um site de comércio eletrônico, o desenvolvedor backend gerencia o catálogo de produtos, processa pedidos, lida com o pagamento online e mantém um sistema de gerenciamento de estoque."
			},
			{
				"name": "Rede Social",
				"description": "Em uma rede social, eles cuidam da criação de perfis de usuário, do feed de notícias, da publicação de conteúdo e da interação entre usuários."
			},
			{
				"name": "Aplicativos da Web Empresariais",
				"description": "Muitas empresas usam aplicativos da web para gerenciar operações internas, como gestão de recursos humanos, contabilidade e comunicação interna. Desenvolvedores backend são responsáveis por construir essas ferramentas."
			},
			{
				"name": "Sistemas de Gerenciamento de Conteúdo (CMS)",
				"description": "CMS como o WordPress são desenvolvidos e mantidos por especialistas em backend para facilitar a criação e a gestão de sites."
			},
			{
				"name": "Blog ou Portal de Notícias",
				"description": "Desenvolvedores backend mantêm a estrutura de um blog ou portal de notícias, permitindo a criação, edição e publicação de artigos."
			}
		],
		"responsabilities": [
			{
				"name": "Gerenciamento de Dados",
				"description": "Eles cuidam das informações que um site ou aplicativo precisa para funcionar, como registros de usuários, postagens de blog e produtos em uma loja online."
			},
			{
				"name": "Lógica do Aplicativo",
				"description": "Eles escrevem o código que permite que o site ou aplicativo faça coisas como processar formulários, fornecer resultados de pesquisa e calcular preços."
			},
			{
				"name": "Integração com Serviços",
				"description": "Eles conectam o site ou aplicativo a outros serviços, como sistemas de pagamento, redes sociais e ferramentas de análise."
			},
			{
				"name": "Desempenho e Escalabilidade",
				"description": "Eles otimizam o desempenho do site ou aplicativo, para que ele seja rápido e possa lidar com muitos usuários ao mesmo tempo."
			},
			{
				"name": "Segurança",
				"description": "Eles garantem que os dados dos usuários sejam mantidos em segurança, usando técnicas como criptografia e verificações de autenticação."
			}
		],
		"companies": [
			{
				"name": "IBM",
				"description": "A IBM é uma das empresas líderes em desenvolvimento de software empresarial, incluindo soluções de backend."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft oferece uma ampla gama de tecnologias e ferramentas de desenvolvimento backend, incluindo o ASP.NET."
			},
			{
				"name": "Oracle",
				"description": "A Oracle é conhecida por seus sistemas de gerenciamento de banco de dados, o que a torna uma escolha popular para desenvolvimento backend."
			},
			{
				"name": "GitHub",
				"description": "Embora seja conhecido principalmente como uma plataforma de controle de versão, o GitHub também oferece hospedagem de aplicativos web por meio do GitHub Pages."
			},
			{
				"name": "MongoDB",
				"description": "A MongoDB é uma empresa conhecida por seu banco de dados NoSQL, que é usado em muitos desenvolvimentos de backend."
			}
		],
		"params": {
			"high_level_coding": 6,
			"low_level_coding": 9,
			"backend": 10,
			"frontend": 4,
			"databases": 9,
			"data_structures": 8,
			"algorithms": 7,
			"hardware": 1,
			"software": 10,
			"infrastructure": 4,
			"design": 3,
			"ui_ux": 1,
			"mobile": 4,
			"desktop": 5,
			"web": 10,
			"tangible_results": 1,
			"abstract_results": 10,
			"theory": 5,
			"practice": 9,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 7,
			"intuition": 8,
			"experimentation": 6,
			"methodology": 9,
			"analysis": 5,
			"adaptability": 8,
			"leadership": 2,
			"communication": 7,
			"team_work": 8,
			"individual_work": 8,
			"management": 3,
			"business": 2,
			"finance": 3,
			"math": 3,
			"physics": 0,
			"chemistry": 0,
			"teaching": 6,
			"mentoring": 5,
			"masters_degree": 4,
			"doctorate_degree": 3,
			"internship": 8,
			"apprenticeship": 9,
			"hiring_potential": 10
		}
	},
	{
		"id": "1022bc2b-ffe7-4a07-a764-2d92827e20cf",
    "active": true,
		"name": "Desenvolvedor Frontend Desktop",
		"description": "Um desenvolvedor frontend para desktop é alguém que cria a parte visual e interativa de aplicativos de computador que são executados em desktops, como laptops ou PCs. Eles se concentram em tornar a interface do usuário (UI) desses aplicativos atraente, funcional e fácil de usar para os usuários finais.",
		"roles": [
			{
				"name": "Desenvolvimento de Aplicativos de Produtividade",
				"description": "Criar aplicativos de produtividade para desktop, como processadores de texto, planilhas, aplicativos de e-mail e software de apresentação."
			},
			{
				"name": "Aplicativos de Design Gráfico",
				"description": "Desenvolver aplicativos de design gráfico, como editores de imagem e software de modelagem 3D, que permitem aos usuários criar arte digital e designs."
			},
			{
				"name": "Sistemas de Gerenciamento de Banco de Dados",
				"description": "Desenvolver interfaces de usuário para aplicativos de gerenciamento de banco de dados, permitindo que os usuários interajam com os dados de forma eficiente."
			},
			{
				"name": "Aplicativos de Comunicação",
				"description": "Criar aplicativos de comunicação, como clientes de mensagens instantâneas e aplicativos de videoconferência, que facilitam a comunicação entre usuários."
			},
			{
				"name": "Aplicativos Financeiros",
				"description": "Construir aplicativos financeiros para desktop que ajudam na gestão de finanças pessoais, contabilidade e análise de investimento."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento de Interfaces Interativas",
				"description": "Eles escrevem código para criar interações entre o usuário e o aplicativo. Isso pode envolver a criação de formulários, campos de entrada, gráficos e outros elementos interativos."
			},
			{
				"name": "Compatibilidade com Diferentes Plataformas",
				"description": "Os desenvolvedores frontend precisam garantir que seus aplicativos funcionem em diferentes sistemas operacionais, como Windows, macOS e Linux, adaptando o código conforme necessário."
			},
			{
				"name": "Atualizações e Manutenção",
				"description": "Mantêm o aplicativo atualizado e garantem que ele continue funcionando bem após atualizações de sistemas operacionais ou mudanças de hardware."
			},
			{
				"name": "Melhoria de Desempenho",
				"description": "Eles otimizam o desempenho do aplicativo para garantir que ele seja responsivo e não apresente lentidão ou travamentos."
			},
			{
				"name": "Colaboração com Desenvolvedores Backend",
				"description": "Trabalham em conjunto com desenvolvedores backend para garantir que a interface do usuário funcione perfeitamente com a lógica do aplicativo que está sendo executada no servidor."
			}
		],
		"companies": [
			{
				"name": "Microsoft",
				"description": "A Microsoft é uma das maiores empresas de tecnologia do mundo e é conhecida por seus sistemas operacionais, como o Windows, e pelo desenvolvimento de software para desktop, como o Microsoft Office."
			},
			{
				"name": "Apple",
				"description": "A Apple é famosa por seus sistemas operacionais macOS e pelo desenvolvimento de software para desktop, incluindo o conjunto de aplicativos iWork e Final Cut Pro."
			},
			{
				"name": "Oracle",
				"description": "A Oracle é conhecida por seus sistemas de gerenciamento de banco de dados e software empresarial, que incluem o Oracle Database e o Oracle E-Business Suite."
			},
			{
				"name": "IBM",
				"description": "A IBM tem uma longa história no desenvolvimento de software para desktop, incluindo sistemas operacionais, aplicativos empresariais e ferramentas de desenvolvimento."
			},
			{
				"name": "Atlassian",
				"description": "A Atlassian desenvolve software de colaboração, incluindo o Jira, usado para gerenciamento de projetos e rastreamento de problemas, e o Confluence, uma plataforma de colaboração."
			}
		],
		"params": {
			"high_level_coding": 8,
			"low_level_coding": 4,
			"backend": 4,
			"frontend": 10,
			"databases": 4,
			"data_structures": 7,
			"algorithms": 6,
			"hardware": 2,
			"software": 10,
			"infrastructure": 2,
			"design": 7,
			"ui_ux": 6,
			"mobile": 4,
			"desktop": 10,
			"web": 5,
			"tangible_results": 2,
			"abstract_results": 10,
			"theory": 5,
			"practice": 10,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 8,
			"intuition": 6,
			"experimentation": 5,
			"methodology": 8,
			"analysis": 5,
			"adaptability": 6,
			"leadership": 3,
			"communication": 6,
			"team_work": 9,
			"individual_work": 8,
			"management": 3,
			"business": 4,
			"finance": 4,
			"math": 6,
			"physics": 2,
			"chemistry": 1,
			"teaching": 5,
			"mentoring": 6,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 8,
			"apprenticeship": 7,
			"hiring_potential": 8
		}
	},
	{
		"id": "78669db3-32e2-4497-a0fc-1656a813ddce",
    "active": true,
		"name": "Desenvolvedor Frontend Mobile",
		"description": "Um desenvolvedor frontend para mobile é alguém que cria a parte visual e interativa de aplicativos móveis, como os que você usa em smartphones e tablets. Eles se concentram em tornar a interface do usuário (UI) desses aplicativos atraente, funcional e fácil de usar para os usuários finais.",
		"roles": [
			{
				"name": "Aplicativos de Redes Sociais",
				"description": "Desenvolver a interface de usuário de aplicativos como Facebook, Instagram e Twitter, tornando a experiência de navegação e interação agradável para os usuários."
			},
			{
				"name": "Aplicativos de Comércio Eletrônico",
				"description": "Criar a interface de aplicativos de compras online, como Amazon e eBay, onde os usuários podem navegar por produtos, adicionar itens ao carrinho e efetuar compras."
			},
			{
				"name": "Aplicativos de Mensagens Instantâneas",
				"description": "Desenvolver a interface de usuário de aplicativos de mensagens como WhatsApp e Messenger, permitindo que os usuários enviem mensagens de texto, fotos e vídeos."
			},
			{
				"name": "Aplicativos de Bancos e Finanças",
				"description": "Criar interfaces de usuário para aplicativos bancários e de serviços financeiros, onde os usuários podem verificar saldos, realizar transferências e pagar contas."
			},
			{
				"name": "Aplicativos de Saúde e Bem-Estar",
				"description": "Desenvolver a interface de usuário para aplicativos de rastreamento de saúde, como Fitbit e MyFitnessPal, que monitoram atividades físicas e hábitos alimentares."
			}
		],
		"responsabilities": [
			{
				"name": "Design de Interface",
				"description": "Os desenvolvedores frontend para mobile projetam a aparência geral do aplicativo móvel, incluindo elementos como botões, menus, telas de login e ícones. Eles se certificam de que o aplicativo seja visualmente atraente e intuitivo."
			},
			{
				"name": "Adaptação a Diferentes Dispositivos",
				"description": "Os desenvolvedores frontend precisam garantir que seus aplicativos funcionem bem em diferentes dispositivos móveis, com telas de tamanhos variados e sistemas operacionais diferentes, como iOS e Android."
			},
			{
				"name": "Compatibilidade com Diferentes Versões do Sistema",
				"description": "Mantêm o aplicativo atualizado para funcionar bem em diferentes versões dos sistemas operacionais móveis, já que esses sistemas costumam passar por atualizações frequentes."
			},
			{
				"name": "Testes e Depuração",
				"description": "Testam rigorosamente o aplicativo em busca de erros e problemas de usabilidade, corrigindo quaisquer problemas que surjam."
			},
			{
				"name": "Colaboração com Desenvolvedores Backend",
				"description": "Trabalham em conjunto com desenvolvedores backend para garantir que a interface do usuário funcione perfeitamente com a lógica do aplicativo que está sendo executada no servidor."
			}
		],
		"companies": [
			{
				"name": "Apple",
				"description": "A Apple é a empresa por trás do sistema operacional iOS, usado em iPhones e iPads. Eles desenvolvem aplicativos nativos e também contratam desenvolvedores para criar aplicativos na App Store."
			},
			{
				"name": "Google",
				"description": "O Google é responsável pelo sistema operacional Android, e eles têm o Google Play Store como sua plataforma de distribuição de aplicativos. Desenvolvedores frontend para mobile trabalham em aplicativos Android."
			},
			{
				"name": "Facebook",
				"description": "O Facebook é conhecido por seus aplicativos sociais, como o Facebook, Instagram e WhatsApp, todos disponíveis em dispositivos móveis. Eles estão constantemente em busca de talentos para melhorar a experiência do usuário nesses aplicativos."
			},
			{
				"name": "Amazon",
				"description": "A Amazon possui aplicativos móveis para compras online, streaming de vídeo (Prime Video) e audiolivros (Audible), e contratam desenvolvedores frontend para melhorar a experiência do usuário."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft também desenvolve aplicativos móveis, incluindo o Microsoft Office e o Microsoft Teams. Eles contratam desenvolvedores para aprimorar a interface do usuário desses aplicativos."
			}
		],
		"params": {
			"high_level_coding": 9,
			"low_level_coding": 3,
			"backend": 2,
			"frontend": 10,
			"databases": 3,
			"data_structures": 7,
			"algorithms": 6,
			"hardware": 2,
			"software": 10,
			"infrastructure": 1,
			"design": 7,
			"ui_ux": 7,
			"mobile": 10,
			"desktop": 3,
			"web": 5,
			"tangible_results": 2,
			"abstract_results": 10,
			"theory": 5,
			"practice": 10,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 8,
			"intuition": 6,
			"experimentation": 5,
			"methodology": 8,
			"analysis": 5,
			"adaptability": 6,
			"leadership": 3,
			"communication": 6,
			"team_work": 9,
			"individual_work": 8,
			"management": 3,
			"business": 4,
			"finance": 4,
			"math": 6,
			"physics": 2,
			"chemistry": 1,
			"teaching": 5,
			"mentoring": 6,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 8,
			"apprenticeship": 7,
			"hiring_potential": 8
		}
	},
	{
		"id": "1a4b2f8b-b984-45f5-b5d8-0994ef1db295",
    "active": true,
		"name": "Desenvolvedor Frontend Web",
		"description": "Um desenvolvedor frontend para web é alguém que cria a parte visual e interativa de sites da internet. Eles são responsáveis por tornar os sites atraentes, funcionais e fáceis de usar para os visitantes.",
		"roles": [
			{
				"name": "Sites de Comércio Eletrônico",
				"description": "Desenvolver a interface de lojas online, onde os usuários podem navegar por produtos, adicionar itens ao carrinho e efetuar compras."
			},
			{
				"name": "Blogs e Sites de Notícias",
				"description": "Criar sites de blogs e notícias onde os visitantes podem ler artigos, assistir a vídeos e interagir com conteúdo."
			},
			{
				"name": "Portfólios Profissionais",
				"description": "Desenvolver sites de portfólios para profissionais e artistas para exibir seus trabalhos e habilidades."
			},
			{
				"name": "Sites de Agências e Empresas",
				"description": "Criar sites corporativos que fornecem informações sobre empresas, produtos e serviços."
			},
			{
				"name": "Plataformas de Redes Sociais",
				"description": "Participar do desenvolvimento de redes sociais e comunidades online, onde os usuários podem se conectar e interagir."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento de Interfaces Interativas",
				"description": "Eles escrevem código para criar interações entre os usuários e o site, permitindo coisas como cliques em botões, preenchimento de formulários e rolagem suave."
			},
			{
				"name": "Compatibilidade com Navegadores",
				"description": "Os desenvolvedores frontend precisam garantir que o site funcione bem em diferentes navegadores, como Chrome, Firefox, Safari e Edge, adaptando o código conforme necessário."
			},
			{
				"name": "Responsividade",
				"description": "Eles criam sites responsivos, o que significa que os sites se ajustam automaticamente a diferentes tamanhos de tela, como desktops, tablets e smartphones."
			},
			{
				"name": "Acessibilidade",
				"description": "Garantem que o site seja acessível para pessoas com deficiências, seguindo padrões de acessibilidade da web."
			},
			{
				"name": "Colaboração com Desenvolvedores Backend",
				"description": "Trabalham em conjunto com desenvolvedores backend para garantir que a interface do usuário funcione perfeitamente com a lógica do site que está sendo executada no servidor."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "O Google é uma das maiores empresas de tecnologia do mundo e desenvolve produtos da web, como o mecanismo de busca Google Search e o serviço de e-mail Gmail."
			},
			{
				"name": "Meta",
				"description": "A Meta é conhecido por suas redes sociais, incluindo o Facebook, o Instagram e o WhatsApp, todos os quais têm interfaces web importantes."
			},
			{
				"name": "Amazon",
				"description": "A Amazon é uma gigante do comércio eletrônico e desenvolve a interface web para suas lojas online, serviços de streaming (Amazon Prime Video) e muito mais."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft tem uma presença significativa na web com produtos como o Office 365 e o serviço de armazenamento em nuvem OneDrive."
			},
			{
				"name": "X (Twitter)",
				"description": "O X é uma plataforma de mídia social que depende de uma interface web eficaz para que os usuários possam criar e acessar seus tweets."
			}
		],
		"params": {
			"high_level_coding": 10,
			"low_level_coding": 2,
			"backend": 2,
			"frontend": 10,
			"databases": 3,
			"data_structures": 7,
			"algorithms": 5,
			"hardware": 2,
			"software": 10,
			"infrastructure": 1,
			"design": 8,
			"ui_ux": 7,
			"mobile": 4,
			"desktop": 3,
			"web": 10,
			"tangible_results": 2,
			"abstract_results": 10,
			"theory": 5,
			"practice": 10,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 8,
			"intuition": 6,
			"experimentation": 5,
			"methodology": 8,
			"analysis": 5,
			"adaptability": 6,
			"leadership": 3,
			"communication": 6,
			"team_work": 9,
			"individual_work": 8,
			"management": 3,
			"business": 4,
			"finance": 4,
			"math": 6,
			"physics": 1,
			"chemistry": 1,
			"teaching": 5,
			"mentoring": 6,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 8,
			"apprenticeship": 7,
			"hiring_potential": 10
		}
	},
	{
		"id": "1c788701-3c95-4c90-a0cb-79533b25cd92",
    "active": true,
		"name": "Desenvolvedor Fullstack Desktop",
		"description": "Um Desenvolvedor Fullstack para Desktop é um profissional de tecnologia que cria aplicativos de software para computadores pessoais e desktops. Eles são responsáveis por todo o ciclo de vida do desenvolvimento de software, desde a concepção e design até a implementação e manutenção. A palavra 'Fullstack' significa que eles têm habilidades tanto na parte do 'front-end' (a interface do usuário) quanto no 'back-end' (a lógica de funcionamento do aplicativo).",
		"roles": [
			{
				"name": "Desenvolvimento de Software Empresarial",
				"description": "Criar aplicativos de gerenciamento de negócios, como sistemas de contabilidade, gestão de estoque e ferramentas de colaboração para uso em ambientes de escritório."
			},
			{
				"name": "Aplicativos de Produtividade",
				"description": "Desenvolver aplicativos que ajudam os usuários a realizar tarefas específicas, como editores de texto avançados, aplicativos de design gráfico e ferramentas de análise de dados."
			},
			{
				"name": "Software de Engenharia e Simulação",
				"description": "Desenvolver ferramentas de simulação e modelagem para engenheiros e cientistas, como software de CAD (Computer-Aided Design) e aplicativos de simulação."
			},
			{
				"name": "Sistemas de Gerenciamento de Informações",
				"description": "Construir aplicativos de banco de dados personalizados para armazenar e acessar informações críticas em empresas e organizações."
			},
			{
				"name": "Aplicativos Educacionais",
				"description": "Criar software educacional para escolas, instituições de ensino superior ou aprendizado online, como plataformas de ensino à distância."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento Frontend",
				"description": "Escrever código para a parte visível do aplicativo, como botões, menus e janelas."
			},
			{
				"name": "Desenvolvimento Backend",
				"description": "Criar a lógica e os componentes que tornam o aplicativo funcional, processando dados, armazenando informações e lidando com a lógica de negócios."
			},
			{
				"name": "Teste e Depuração",
				"description": "Verificar se o aplicativo funciona corretamente, identificar e corrigir bugs (erros) e realizar testes de desempenho."
			},
			{
				"name": "Manutenção",
				"description": "Atualizar e aprimorar o aplicativo à medida que novos recursos são necessários ou surgem atualizações de sistema."
			},
			{
				"name": "Colaboração",
				"description": "Trabalhar em equipe com outros desenvolvedores, designers e profissionais de QA para garantir a entrega bem-sucedida do projeto."
			}
		],
		"companies": [
			{
				"name": "Microsoft",
				"description": "Uma das maiores empresas de tecnologia do mundo, conhecida por produtos como o sistema operacional Windows e a suíte de produtividade Office."
			},
			{
				"name": "Apple",
				"description": "Fabricante do sistema operacional macOS e criadora de aplicativos de desktop populares, como o macOS Finder e o software de edição de vídeo Final Cut Pro."
			},
			{
				"name": "Google",
				"description": "Responsável pelo sistema operacional Chrome OS e aplicativos de desktop como o Google Chrome e o Google Drive."
			},
			{
				"name": "Oracle",
				"description": "Especializada em software empresarial, incluindo bancos de dados e aplicativos para desktop."
			},
			{
				"name": "Atlassian",
				"description": "Conhecida por suas ferramentas de colaboração, como o Jira e o Confluence."
			}
		],
		"params": {
			"high_level_coding": 6,
			"low_level_coding": 9,
			"backend": 10,
			"frontend": 10,
			"databases": 8,
			"data_structures": 7,
			"algorithms": 8,
			"hardware": 2,
			"software": 10,
			"infrastructure": 5,
			"design": 5,
			"ui_ux": 5,
			"mobile": 4,
			"desktop": 10,
			"web": 3,
			"tangible_results": 3,
			"abstract_results": 9,
			"theory": 5,
			"practice": 9,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 8,
			"intuition": 6,
			"experimentation": 5,
			"methodology": 8,
			"analysis": 5,
			"adaptability": 6,
			"leadership": 3,
			"communication": 6,
			"team_work": 9,
			"individual_work": 8,
			"management": 3,
			"business": 4,
			"finance": 4,
			"math": 6,
			"physics": 2,
			"chemistry": 1,
			"teaching": 5,
			"mentoring": 6,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 8,
			"apprenticeship": 7,
			"hiring_potential": 8
		}
	},
	{
		"id": "8ba2468a-1e02-4e65-a3d6-b30342b4067e",
    "active": true,
		"name": "Desenvolvedor Fullstack Mobile",
		"description": "Um Desenvolvedor Fullstack para Mobile é um profissional de tecnologia que projeta, desenvolve e mantém aplicativos móveis para dispositivos como smartphones e tablets. Esses desenvolvedores são responsáveis por criar a experiência completa do aplicativo, desde a interface do usuário (parte visível) até a lógica de funcionamento (parte invisível) e a integração com serviços externos.",
		"roles": [
			{
				"name": "Aplicativos de Redes Sociais",
				"description": "Desenvolver aplicativos como Facebook, Instagram e Twitter, que oferecem recursos de mídia social em dispositivos móveis."
			},
			{
				"name": "Aplicativos de Comércio Eletrônico",
				"description": "Criar aplicativos para empresas de varejo que permitem aos usuários comprar produtos online e fazer transações financeiras."
			},
			{
				"name": "Aplicativos de Streaming de Mídia",
				"description": "Desenvolver aplicativos de streaming de vídeo e música, como Netflix, Spotify e YouTube."
			},
			{
				"name": "Aplicativos de Produtividade",
				"description": "Desenvolver aplicativos que auxiliam na organização pessoal, gerenciamento de tarefas e colaboração em equipe."
			},
			{
				"name": "Aplicativos de Bancos e Finanças",
				"description": "Desenvolver aplicativos bancários e de investimento que permitem aos usuários gerenciar contas e realizar transações financeiras."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento Frontend",
				"description": "Criar a interface do usuário de um aplicativo móvel, incluindo layouts, botões, gráficos e elementos interativos."
			},
			{
				"name": "Desenvolvimento Backend",
				"description": "Construir a parte 'invisível' do aplicativo, que lida com o processamento de dados, a lógica de negócios e a comunicação com servidores."
			},
			{
				"name": "Programação de Aplicativos Nativos",
				"description": "Desenvolver aplicativos móveis nativos para plataformas específicas, como iOS (usando Swift ou Objective-C) ou Android (usando Java ou Kotlin)."
			},
			{
				"name": "Atualizações e Manutenção",
				"description": "Manter o aplicativo atualizado com novos recursos, correções de bugs e compatibilidade com as versões mais recentes do sistema operacional."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Melhorar o desempenho do aplicativo, garantindo que ele seja responsivo e eficiente em termos de recursos."
			}
		],
		"companies": [
			{
				"name": "Apple",
				"description": "A empresa por trás do iOS, que desenvolve aplicativos móveis nativos para dispositivos como iPhone e iPad."
			},
			{
				"name": "Google",
				"description": "Criadora do sistema operacional Android e de aplicativos móveis populares como o Google Maps, Gmail e Google Drive."
			},
			{
				"name": "Facebook",
				"description": "Responsável pelos aplicativos de mídia social mais utilizados do mundo, incluindo o Facebook, Instagram e WhatsApp."
			},
			{
				"name": "Aplicativos Bancários",
				"description": "Bancos e instituições financeiras, como Bank of America, Wells Fargo e PayPal, desenvolvem aplicativos móveis para serviços bancários e financeiros."
			},
			{
				"name": "Startups",
				"description": "Muitas startups em todo o mundo estão focadas no desenvolvimento de aplicativos móveis inovadores em uma variedade de setores, desde saúde até transporte e educação."
			}
		],
		"params": {
			"high_level_coding": 7,
			"low_level_coding": 9,
			"backend": 10,
			"frontend": 10,
			"databases": 7,
			"data_structures": 7,
			"algorithms": 7,
			"hardware": 2,
			"software": 9,
			"infrastructure": 4,
			"design": 5,
			"ui_ux": 5,
			"mobile": 9,
			"desktop": 5,
			"web": 4,
			"tangible_results": 3,
			"abstract_results": 9,
			"theory": 6,
			"practice": 8,
			"curiosity": 8,
			"practicality": 7,
			"creativity": 7,
			"logic": 7,
			"intuition": 6,
			"experimentation": 5,
			"methodology": 8,
			"analysis": 6,
			"adaptability": 8,
			"leadership": 3,
			"communication": 6,
			"team_work": 8,
			"individual_work": 7,
			"management": 5,
			"business": 4,
			"finance": 3,
			"math": 4,
			"physics": 0,
			"chemistry": 0,
			"teaching": 3,
			"mentoring": 4,
			"masters_degree": 5,
			"doctorate_degree": 4,
			"internship": 6,
			"apprenticeship": 6,
			"hiring_potential": 8
		}
	},
	{
		"id": "75113a68-98ad-4399-ac87-28e4f823b1cd",
    "active": true,
		"name": "Desenvolvedor Fullstack Web",
		"description": "Um Desenvolvedor Fullstack para Web é um profissional de tecnologia que cria aplicativos e sites para a internet. Esses desenvolvedores têm habilidades tanto no 'front-end' (a parte visível de um site ou aplicativo) quanto no 'back-end' (a parte invisível que lida com o funcionamento e os dados por trás da interface).",
		"roles": [
			{
				"name": "Websites Corporativos",
				"description": "Desenvolver sites para empresas e organizações que fornecem informações sobre produtos, serviços e contato."
			},
			{
				"name": "Lojas Online (e-commerce)",
				"description": "Criar plataformas de comércio eletrônico que permitem aos clientes comprar produtos online."
			},
			{
				"name": "Aplicativos Web",
				"description": "Construir aplicativos baseados na web para diversas finalidades, como aplicativos de produtividade, gerenciamento de projetos e muito mais."
			},
			{
				"name": "Sites de Notícias e Mídias",
				"description": "Desenvolver sites de notícias, streaming de vídeo e áudio, e plataformas de entretenimento online."
			},
			{
				"name": "Plataformas de Aprendizado Online",
				"description": "Desenvolver sistemas de gerenciamento de aprendizado (LMS) para cursos online, treinamento e educação."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento Frontend",
				"description": "Criar a aparência e a interação de um site ou aplicativo, incluindo elementos como layouts, botões e animações."
			},
			{
				"name": "Desenvolvimento Backend",
				"description": "Construir a lógica de funcionamento de um site ou aplicativo, lidando com armazenamento de dados, segurança e processamento de informações."
			},
			{
				"name": "Programação de Sites e Aplicativos",
				"description": "Utilizar linguagens de programação, como HTML, CSS, JavaScript, Python, Ruby, entre outras, para construir sites e aplicativos funcionais."
			},
			{
				"name": "Teste e Depuração",
				"description": "Verificar se o site ou aplicativo funciona corretamente, identificar e corrigir erros (bugs) e realizar testes de usabilidade."
			},
			{
				"name": "Manutenção e Atualizações",
				"description": "Manter o site ou aplicativo atualizado, adicionando novos recursos e melhorando o desempenho conforme necessário."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "Além de ser uma das maiores empresas de tecnologia do mundo, o Google desenvolve uma variedade de aplicativos e serviços da web, incluindo o mecanismo de busca mais popular."
			},
			{
				"name": "Apple",
				"description": "Além de criar dispositivos, como o iPhone e o Mac, a Apple também desenvolve aplicativos e serviços da web, como o iCloud."
			},
			{
				"name": "GitHub",
				"description": "Uma plataforma de hospedagem de código-fonte que é fundamental para desenvolvedores que trabalham em projetos colaborativos de código aberto."
			},
			{
				"name": "WordPress",
				"description": "Uma plataforma de gerenciamento de conteúdo (CMS) amplamente utilizada para criar blogs e sites."
			},
			{
				"name": "Facebook",
				"description": "Responsável pela maior rede social do mundo, o Facebook também possui o Instagram e o WhatsApp, que são aplicativos populares na web."
			}
		],
		"params": {
			"high_level_coding": 9,
			"low_level_coding": 8,
			"backend": 10,
			"frontend": 10,
			"databases": 8,
			"data_structures": 7,
			"algorithms": 6,
			"hardware": 1,
			"software": 10,
			"infrastructure": 3,
			"design": 5,
			"ui_ux": 6,
			"mobile": 4,
			"desktop": 5,
			"web": 10,
			"tangible_results": 2,
			"abstract_results": 10,
			"theory": 4,
			"practice": 9,
			"curiosity": 8,
			"practicality": 9,
			"creativity": 7,
			"logic": 7,
			"intuition": 8,
			"experimentation": 6,
			"methodology": 9,
			"analysis": 5,
			"adaptability": 8,
			"leadership": 2,
			"communication": 7,
			"team_work": 8,
			"individual_work": 8,
			"management": 3,
			"business": 2,
			"finance": 3,
			"math": 3,
			"physics": 0,
			"chemistry": 0,
			"teaching": 6,
			"mentoring": 5,
			"masters_degree": 4,
			"doctorate_degree": 3,
			"internship": 9,
			"apprenticeship": 9,
			"hiring_potential": 10
		}
	},
	{
		"id": "5335d533-4512-4d93-b258-96c0218c7bcb",
    "active": false,
		"name": "Desenvolvedor de Firmware",
		"description": "Um Desenvolvedor de Firmware é um profissional de tecnologia que cria e mantém o software incorporado em dispositivos eletrônicos. Esse software, conhecido como firmware, está intimamente ligado ao hardware do dispositivo e é responsável por controlar suas funções e operações.",
		"roles": [
			{
				"name": "Automóveis Inteligentes",
				"description": "Desenvolver firmware para controlar sistemas de segurança, entretenimento e controle do motor em veículos modernos."
			},
			{
				"name": "Dispositivos de Áudio",
				"description": "Projetar o firmware de fones de ouvido, alto-falantes inteligentes e sistemas de som para garantir uma reprodução de áudio de alta qualidade."
			},
			{
				"name": "Dispositivos de Armazenamento",
				"description": "Desenvolver firmware para unidades de disco rígido (HDDs), unidades de estado sólido (SSDs) e outros dispositivos de armazenamento."
			},
			{
				"name": "Controles de Jogo",
				"description": "Projetar o firmware de controles de jogos, como gamepads e joysticks, para plataformas de jogos."
			},
			{
				"name": "Dispositivos de Processamento e Gráficos",
				"description": "Desenvolver firmware de dispositivos como processadores e placas de vídeo."
			}
		],
		"responsabilities": [
			{
				"name": "Programação de Baixo Nível",
				"description": "Escrever código de programação de baixo nível que opera diretamente no hardware do dispositivo."
			},
			{
				"name": "Desenvolvimento e Otimização de Algoritmos",
				"description": "Projetar e implementar algoritmos eficientes para controlar o funcionamento do dispositivo."
			},
			{
				"name": "Integração de Hardware e Software",
				"description": "Garantir que o firmware funcione perfeitamente com os componentes de hardware, como sensores, processadores e memória."
			},
			{
				"name": "Gerenciamento de Energia",
				"description": "Otimizar o uso de energia para dispositivos com restrições de bateria, como smartphones, dispositivos médicos e sistemas embarcados."
			},
			{
				"name": "Atualizações e Manutenção",
				"description": "Manter o firmware atualizado, corrigindo vulnerabilidades de segurança, adicionando novos recursos e melhorando o desempenho."
			}
		],
		"companies": [
			{
				"name": "Intel",
				"description": "Uma das maiores fabricantes de processadores e chips do mundo, a Intel desenvolve firmware para uma ampla gama de produtos eletrônicos."
			},
			{
				"name": "Qualcomm",
				"description": "Especializada em chips e tecnologia sem fio, a Qualcomm cria firmware para dispositivos móveis, redes e IoT."
			},
			{
				"name": "NVIDIA",
				"description": "Conhecida por suas GPUs e chips gráficos, a NVIDIA cria firmware para placas gráficas e sistemas de IA."
			},
			{
				"name": "IBM",
				"description": "A IBM cria firmware para servidores, mainframes e sistemas de computação de alto desempenho."
			},
			{
				"name": "Western Digital",
				"description": "A Western Digital desenvolve firmware para unidades de disco rígido (HDDs) e unidades de estado sólido (SSDs)."
			}
		],
		"params": {
			"high_level_coding": 2,
			"low_level_coding": 10,
			"backend": 10,
			"frontend": 0,
			"databases": 4,
			"data_structures": 8,
			"algorithms": 9,
			"hardware": 7,
			"software": 8,
			"infrastructure": 9,
			"design": 1,
			"ui_ux": 0,
			"mobile": 6,
			"desktop": 9,
			"web": 1,
			"tangible_results": 5,
			"abstract_results": 9,
			"theory": 9,
			"practice": 7,
			"curiosity": 8,
			"practicality": 4,
			"creativity": 8,
			"logic": 10,
			"intuition": 3,
			"experimentation": 7,
			"methodology": 6,
			"analysis": 8,
			"adaptability": 6,
			"leadership": 3,
			"communication": 5,
			"team_work": 6,
			"individual_work": 8,
			"management": 2,
			"business": 1,
			"finance": 1,
			"math": 8,
			"physics": 3,
			"chemistry": 1,
			"teaching": 2,
			"mentoring": 3,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 3,
			"apprenticeship": 4,
			"hiring_potential": 6
		}
	},
	{
		"id": "28662722-a323-40d9-991c-abdfb1cdc190",
    "active": true,
		"name": "Desenvolvedor de Jogos",
		"description": "Um Desenvolvedor de Jogos é um profissional que cria, projeta e programa jogos eletrônicos. Essa profissão envolve a aplicação de habilidades técnicas e criativas para criar experiências interativas de entretenimento. Os desenvolvedores de jogos trabalham em equipes multidisciplinares e são responsáveis por diferentes aspectos do processo de desenvolvimento de jogos, desde a programação até o design de personagens e a narrativa. Geralmente quem almeja trabalhar em jogos começa como desenvolvedor, mas com o tempo pode se especializar em uma área específica como design de jogos, arte ou programação.",
		"roles": [
			{
				"name": "Desenvolvimento de Jogos para Dispositivos Móveis",
				"description": "Criar jogos para smartphones e tablets que podem ser baixados em lojas de aplicativos."
			},
			{
				"name": "Desenvolvimento de Jogos de Console/Computador",
				"description": "Trabalhar em equipes que criam jogos para computadores ou consoles de videogame, como PlayStation, Xbox e Nintendo Switch."
			},
			{
				"name": "Desenvolvimento de Jogos de Simulação",
				"description": "Criar jogos de simulação que replicam situações da vida real, como simulações de voo ou gerenciamento de cidades."
			},
			{
				"name": "Desenvolvimento de Jogos para a Web",
				"description": "Criar jogos que podem ser jogados diretamente no navegador da web."
			},
			{
				"name": "Desenvolvimento de Jogos de Realidade Virtual (VR) e Aumentada (AR)",
				"description": "Criar experiências de jogos imersivas para dispositivos de VR e AR, como Oculus Rift e HoloLens."
			}
		],
		"responsabilities": [
			{
				"name": "Programação de Jogos",
				"description": "Criar jogos para smartphones e tablets que podem ser baixados em lojas de aplicativos."
			},
			{
				"name": "Design de Jogos",
				"description": "Projetar a estrutura do jogo, incluindo a jogabilidade, os níveis, personagens, regras e objetivos."
			},
			{
				"name": "Arte e Gráficos",
				"description": "Criar ou colaborar na criação de elementos visuais, como modelos 3D, texturas, animações e efeitos visuais."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Melhorar o desempenho do jogo para garantir que ele seja executado de maneira suave em diferentes plataformas."
			},
			{
				"name": "Testes e Depuração",
				"description": "Identificar e corrigir bugs e problemas de desempenho no jogo durante o desenvolvimento."
			}
		],
		"companies": [
			{
				"name": "Rockstar Games",
				"description": "A Rockstar é conhecida por jogos como Grand Theft Auto (GTA) e Red Dead Redemption."
			},
			{
				"name": "Valve Corporation",
				"description": "A Valve é responsável pela plataforma Steam e pelos jogos Half-Life, Portal e Counter-Strike."
			},
			{
				"name": "Epic Games",
				"description": "A Epic Games é a criadora de Fortnite, um dos jogos mais populares do mundo, e do motor gráfico Unreal Engine."
			},
			{
				"name": "Capcom",
				"description": "A Capcom é famosa por séries como Resident Evil, Street Fighter e Monster Hunter."
			},
			{
				"name": "CD Projekt Red",
				"description": "Esta empresa polonesa é famosa pela série The Witcher e pelo jogo Cyberpunk 2077."
			}
		],
		"params": {
			"high_level_coding": 3,
			"low_level_coding": 9,
			"backend": 8,
			"frontend": 5,
			"databases": 4,
			"data_structures": 7,
			"algorithms": 8,
			"hardware": 6,
			"software": 9,
			"infrastructure": 1,
			"design": 8,
			"ui_ux": 4,
			"mobile": 7,
			"desktop": 9,
			"web": 4,
			"tangible_results": 2,
			"abstract_results": 10,
			"theory": 6,
			"practice": 10,
			"curiosity": 10,
			"practicality": 5,
			"creativity": 10,
			"logic": 7,
			"intuition": 9,
			"experimentation": 10,
			"methodology": 5,
			"analysis": 8,
			"adaptability": 10,
			"leadership": 4,
			"communication": 8,
			"team_work": 9,
			"individual_work": 5,
			"management": 4,
			"business": 3,
			"finance": 2,
			"math": 7,
			"physics": 6,
			"chemistry": 2,
			"teaching": 1,
			"mentoring": 2,
			"masters_degree": 4,
			"doctorate_degree": 3,
			"internship": 2,
			"apprenticeship": 2,
			"hiring_potential": 3
		}
	},
	{
		"id": "7caed8c7-2046-4d86-802a-a605b0153c0e",
    "active": true,
		"name": "Designer UI/UX",
		"description": "Um designer UI/UX é alguém que projeta a aparência e a experiência geral que os usuários têm ao interagir com um produto digital, como um site, aplicativo móvel ou software. Essa profissão se concentra em tornar a interface do usuário (UI) atraente, funcional e fácil de usar, enquanto proporciona uma experiência do usuário (UX) satisfatória.",
		"roles": [
			{
				"name": "Desenvolvimento de Sites",
				"description": "Projetar a interface e a experiência do usuário para sites, garantindo que a navegação seja fácil e que a aparência seja atraente."
			},
			{
				"name": "Aplicativos Móveis",
				"description": "Criar a interface e a experiência do usuário para aplicativos móveis, garantindo que sejam intuitivos e envolventes."
			},
			{
				"name": "Software Empresarial",
				"description": "Projetar a interface de software utilizado em ambientes corporativos, como sistemas de gerenciamento de recursos humanos ou de contabilidade."
			},
			{
				"name": "Plataformas de E-Commerce",
				"description": "Projetar a interface de lojas online, focando na facilidade de compra e na apresentação dos produtos."
			},
			{
				"name": "Redes Sociais",
				"description": "Criar a interface e a experiência do usuário para plataformas de mídia social, facilitando a interação e a comunicação entre os usuários."
			}
		],
		"responsabilities": [
			{
				"name": "Design Visual",
				"description": "Criar a aparência geral do produto digital, incluindo elementos visuais como cores, tipografia, ícones e layout."
			},
			{
				"name": "Elementos Interativos",
				"description": "Projetar botões, menus, formulários e outros elementos com os quais os usuários interagem, tornando-os visualmente atraentes e intuitivos."
			},
			{
				"name": "Pesquisa do Usuário",
				"description": "Realizar pesquisas para entender as necessidades, preferências e comportamentos dos usuários, visando criar uma experiência centrada no usuário."
			},
			{
				"name": "Fluxo de Usuário",
				"description": "Projetar a jornada do usuário através do produto, garantindo que seja lógica e eficiente, desde a entrada até a conclusão de tarefas."
			},
			{
				"name": "Prototipagem",
				"description": "Criar protótipos interativos que permitem testar e iterar o design antes da implementação final."
			}
		],
		"companies": [
			{
				"name": "Apple",
				"description": "A Apple é conhecida por seu compromisso com o design de alta qualidade em seus produtos, incluindo interfaces de usuário elegantes e intuitivas em dispositivos iOS, macOS e outros."
			},
			{
				"name": "Google",
				"description": "O Google foca em fornecer uma experiência de usuário consistente e amigável em seus produtos, como o mecanismo de busca Google, o sistema operacional Android e aplicativos relacionados."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft se concentra no design de interfaces de usuário para uma ampla gama de produtos, incluindo o sistema operacional Windows, a suíte Office e plataformas em nuvem como o Azure."
			},
			{
				"name": "Netflix",
				"description": "A Netflix oferece uma experiência de usuário intuitiva e agradável em seu serviço de streaming de vídeo."
			},
			{
				"name": "Spotify",
				"description": "O Spotify oferece uma experiência de usuário bem projetada em seu serviço de streaming de música."
			}
		],
		"params": {
			"high_level_coding": 3,
			"low_level_coding": 0,
			"backend": 0,
			"frontend": 10,
			"databases": 2,
			"data_structures": 3,
			"algorithms": 1,
			"hardware": 2,
			"software": 10,
			"infrastructure": 0,
			"design": 10,
			"ui_ux": 10,
			"mobile": 10,
			"desktop": 10,
			"web": 10,
			"tangible_results": 4,
			"abstract_results": 10,
			"theory": 9,
			"practice": 10,
			"curiosity": 10,
			"practicality": 10,
			"creativity": 10,
			"logic": 5,
			"intuition": 10,
			"experimentation": 7,
			"methodology": 9,
			"analysis": 10,
			"adaptability": 10,
			"leadership": 3,
			"communication": 9,
			"team_work": 8,
			"individual_work": 8,
			"management": 4,
			"business": 5,
			"finance": 2,
			"math": 2,
			"physics": 0,
			"chemistry": 0,
			"teaching": 7,
			"mentoring": 7,
			"masters_degree": 8,
			"doctorate_degree": 8,
			"internship": 7,
			"apprenticeship": 4,
			"hiring_potential": 8
		}
	},
	{
		"id": "15e9c91a-3410-4e2c-8a09-7337f5519c68",
    "active": true,
		"name": "Designer de Circuitos Integrados",
		"description": "Um Designer de Circuitos Integrados é um profissional de engenharia eletrônica que projeta e desenvolve circuitos eletrônicos complexos e integrados em um único chip, conhecidos como Circuitos Integrados (CI) ou Chips IC (Integrated Circuits). Esses chips podem ser encontrados em quase todos os dispositivos eletrônicos, desde smartphones e computadores até sistemas automotivos e dispositivos médicos.",
		"roles": [
			{
				"name": "Processadores de Computador",
				"description": "Projetar circuitos integrados para CPUs (Unidades de Processamento Central) usadas em laptops, desktops e servidores."
			},
			{
				"name": "Chips Gráficos",
				"description": "Desenvolver circuitos para placas gráficas usadas em jogos e aplicativos de alta intensidade gráfica."
			},
			{
				"name": "Microcontroladores",
				"description": "Projetar chips para microcontroladores usados em dispositivos de automação residencial, brinquedos e produtos eletrônicos de consumo."
			},
			{
				"name": "Sensores Integrados",
				"description": "Criar chips que incluem sensores integrados, como sensores de movimento, luz ou temperatura."
			},
			{
				"name": "Chips de Segurança",
				"description": "Projetar chips de segurança usados em cartões inteligentes, dispositivos de autenticação e sistemas de pagamento."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Circuitos Eletrônicos",
				"description": "Desenvolver esquemas de circuitos e diagramas elétricos para realizar funções específicas, como processamento de sinais, comunicação ou controle."
			},
			{
				"name": "Layout de Chips",
				"description": "Projetar o layout físico dos componentes eletrônicos no chip, garantindo um design eficiente e compacto."
			},
			{
				"name": "Simulação e Teste",
				"description": "Realizar simulações para verificar o funcionamento teórico do circuito e realizar testes práticos para verificar o desempenho real."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Aprimorar o desempenho do chip, reduzindo o consumo de energia, melhorando a velocidade ou aumentando a capacidade de processamento."
			},
			{
				"name": "Garantia de Qualidade",
				"description": "Garantir que os chips atendam aos padrões de qualidade e especificações técnicas necessárias."
			}
		],
		"companies": [
			{
				"name": "Intel",
				"description": "A Intel é uma das maiores fabricantes de CIs do mundo, conhecida por seus processadores de computador."
			},
			{
				"name": "TSMC (Taiwan Semiconductor Manufacturing Company)",
				"description": "A TSMC é uma das principais empresas de fabricação de semicondutores e produz CIs para várias empresas de tecnologia."
			},
			{
				"name": "NVIDIA",
				"description": "Especializada em unidades de processamento gráfico (GPUs), a NVIDIA desenvolve CIs para gráficos de alta performance."
			},
			{
				"name": "AMD (Advanced Micro Devices)",
				"description": "A AMD é conhecida por seus processadores e placas gráficas e projeta CIs para computação de alto desempenho."
			},
			{
				"name": "Qualcomm",
				"description": "A Qualcomm cria CIs para tecnologia sem fio e dispositivos móveis, incluindo processadores Snapdragon."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 4,
			"backend": 3,
			"frontend": 0,
			"databases": 4,
			"data_structures": 4,
			"algorithms": 5,
			"hardware": 10,
			"software": 3,
			"infrastructure": 6,
			"design": 7,
			"ui_ux": 0,
			"mobile": 7,
			"desktop": 10,
			"web": 0,
			"tangible_results": 9,
			"abstract_results": 7,
			"theory": 9,
			"practice": 7,
			"curiosity": 8,
			"practicality": 4,
			"creativity": 8,
			"logic": 10,
			"intuition": 3,
			"experimentation": 9,
			"methodology": 7,
			"analysis": 10,
			"adaptability": 5,
			"leadership": 2,
			"communication": 5,
			"team_work": 6,
			"individual_work": 8,
			"management": 1,
			"business": 2,
			"finance": 2,
			"math": 7,
			"physics": 9,
			"chemistry": 7,
			"teaching": 2,
			"mentoring": 4,
			"masters_degree": 9,
			"doctorate_degree": 9,
			"internship": 3,
			"apprenticeship": 4,
			"hiring_potential": 6
		}
	},
	{
		"id": "70bc3d3b-0e80-4327-81d9-2419f2bd76f1",
    "active": true,
		"name": "Engenheiro de Dados",
		"description": "Um Engenheiro de Dados é um profissional que desempenha um papel fundamental na coleta, organização e análise de dados em uma empresa. Eles são responsáveis por projetar e construir sistemas e infraestruturas de dados que permitem a captura, o armazenamento e a transformação de grandes volumes de informações. Essa profissão é crucial para ajudar as empresas a tomar decisões informadas, identificar tendências e padrões, e desenvolver soluções baseadas em dados.",
		"roles": [
			{
				"name": "Análise de Negócios",
				"description": "Coletar e analisar dados de vendas, marketing e operações para identificar oportunidades de crescimento e eficiência."
			},
			{
				"name": "Personalização de Conteúdo",
				"description": "Desenvolver sistemas que personalizam conteúdo e recomendações com base no comportamento do usuário."
			},
			{
				"name": "Análise de Redes Sociais",
				"description": "Extrair insights de redes sociais para entender o comportamento do consumidor e melhorar o engajamento."
			},
			{
				"name": "Previsão e Recomendação",
				"description": "Criar modelos preditivos para prever tendências de mercado, demanda do cliente e recomendar ações."
			},
			{
				"name": "Ciência de Dados",
				"description": "Colaborar com cientistas de dados para desenvolver modelos preditivos e explorar dados em profundidade."
			}
		],
		"responsabilities": [
			{
				"name": "Coleta de Dados",
				"description": "Identificar fontes de dados relevantes para a empresa e criar mecanismos para coletar informações de diversas fontes, como bancos de dados, sensores, mídias sociais e muito mais."
			},
			{
				"name": "Análise de Dados",
				"description": "Utilizar ferramentas de análise de dados e técnicas estatísticas para extrair informações valiosas dos conjuntos de dados."
			},
			{
				"name": "Processamento de Dados em Tempo Real",
				"description": "Desenvolver sistemas que processam dados em tempo real, permitindo análises e ações imediatas."
			},
			{
				"name": "Integração de Dados",
				"description": "Integrar dados de diferentes fontes e sistemas para criar uma visão unificada."
			},
			{
				"name": "Automatização de Processos",
				"description": "Desenvolver scripts e sistemas automatizados para tarefas de rotina, como atualizações de dados."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "A Rockstar é conhecida por jogos como Grand Theft Auto (GTA) e Red Dead Redemption."
			},
			{
				"name": "Amazon Web Services (AWS)",
				"description": "A Valve é responsável pela plataforma Steam e pelos jogos Half-Life, Portal e Counter-Strike."
			},
			{
				"name": "Snowflake",
				"description": "A Epic Games é a criadora de Fortnite, um dos jogos mais populares do mundo, e do motor gráfico Unreal Engine."
			},
			{
				"name": "IBM",
				"description": "A Capcom é famosa por séries como Resident Evil, Street Fighter e Monster Hunter."
			},
			{
				"name": "Microsoft Azure",
				"description": "Esta empresa polonesa é famosa pela série The Witcher e pelo jogo Cyberpunk 2077."
			}
		],
		"params": {
			"high_level_coding": 8,
			"low_level_coding": 4,
			"backend": 10,
			"frontend": 6,
			"databases": 10,
			"data_structures": 9,
			"algorithms": 6,
			"hardware": 3,
			"software": 9,
			"infrastructure": 4,
			"design": 5,
			"ui_ux": 1,
			"mobile": 6,
			"desktop": 7,
			"web": 6,
			"tangible_results": 3,
			"abstract_results": 10,
			"theory": 9,
			"practice": 7,
			"curiosity": 7,
			"practicality": 6,
			"creativity": 4,
			"logic": 8,
			"intuition": 7,
			"experimentation": 10,
			"methodology": 10,
			"analysis": 10,
			"adaptability": 8,
			"leadership": 2,
			"communication": 6,
			"team_work": 6,
			"individual_work": 8,
			"management": 5,
			"business": 5,
			"finance": 5,
			"math": 8,
			"physics": 0,
			"chemistry": 0,
			"teaching": 4,
			"mentoring": 6,
			"masters_degree": 8,
			"doctorate_degree": 9,
			"internship": 6,
			"apprenticeship": 6,
			"hiring_potential": 7
		}
	},
	{
		"id": "2c5eaa88-c003-4f9a-8b85-fde640f2a5da",
    "active": false,
		"name": "Engenheiro de DevOps",
		"description": "Um Engenheiro de DevOps é um profissional de tecnologia responsável por melhorar a colaboração entre as equipes de desenvolvimento de software (Dev) e operações de infraestrutura (Ops) em uma organização. A principal missão de um Engenheiro de DevOps é automatizar e agilizar o processo de desenvolvimento, teste e implantação de software, garantindo a entrega rápida e confiável de aplicativos.",
		"roles": [
			{
				"name": "Implantação Contínua de Aplicativos Web",
				"description": "Automatizar o processo de implantação de aplicativos da web para garantir atualizações rápidas e sem interrupções de serviço."
			},
			{
				"name": "Gerenciamento de Infraestrutura na Nuvem",
				"description": "Projetar e automatizar a implantação de infraestrutura na nuvem usando serviços como AWS, Azure ou Google Cloud."
			},
			{
				"name": "Automatização de Infraestrutura como Código (IaC)",
				"description": "Implementar IaC para criar, configurar e gerenciar recursos de infraestrutura usando código."
			},
			{
				"name": "Implantação de Microserviços",
				"description": "Automatizar a implantação de microserviços para aplicativos complexos baseados em arquiteturas de microserviços."
			},
			{
				"name": "Segurança DevSecOps",
				"description": "Integrar práticas de segurança desde o início do ciclo de vida de desenvolvimento para garantir aplicativos mais seguros."
			}
		],
		"responsabilities": [
			{
				"name": "Automação de Fluxos de Trabalho",
				"description": "Desenvolver scripts e ferramentas para automatizar tarefas de desenvolvimento, teste e implantação de software."
			},
			{
				"name": "Integração Contínua (CI)",
				"description": "Configurar e gerenciar sistemas de CI para compilar, testar e validar automaticamente o código sempre que há alterações."
			},
			{
				"name": "Entrega Contínua (CD)",
				"description": "Implementar práticas de CD para automatizar a implantação de código em ambientes de produção de forma rápida e segura."
			},
			{
				"name": "Segurança e Conformidade",
				"description": "Implementar práticas de segurança e conformidade, como varreduras de segurança e auditorias de conformidade, para proteger os aplicativos."
			},
			{
				"name": "Colaboração e Comunicação",
				"description": "Facilitar a comunicação e a colaboração entre equipes de desenvolvimento e operações para garantir a entrega eficiente de software."
			}
		],
		"companies": [
			{
				"name": "Amazon Web Services (AWS)",
				"description": "A AWS é um dos principais provedores de serviços em nuvem e oferece uma ampla gama de ferramentas e serviços para práticas de DevOps."
			},
			{
				"name": "Microsoft Azure",
				"description": "A Microsoft Azure é outra grande plataforma de computação em nuvem que oferece recursos para automação e integração contínua."
			},
			{
				"name": "Google Cloud Platform (GCP)",
				"description": "O GCP da Google fornece serviços de nuvem que podem ser usados para implementações de DevOps, incluindo contêineres e orquestração."
			},
			{
				"name": "Docker",
				"description": "A Docker é uma empresa líder em tecnologia de contêineres e oferece ferramentas para orquestração e automação de contêineres, que são fundamentais para práticas de DevOps."
			},
			{
				"name": "Red Hat",
				"description": "A Red Hat oferece soluções de código aberto, como Ansible e OpenShift, que são usadas para automação e orquestração em ambientes de DevOps."
			}
		],
		"params": {
			"high_level_coding": 5,
			"low_level_coding": 5,
			"backend": 7,
			"frontend": 3,
			"databases": 6,
			"data_structures": 5,
			"algorithms": 4,
			"hardware": 3,
			"software": 9,
			"infrastructure": 9,
			"design": 3,
			"ui_ux": 5,
			"mobile": 4,
			"desktop": 8,
			"web": 6,
			"tangible_results": 7,
			"abstract_results": 6,
			"theory": 3,
			"practice": 8,
			"curiosity": 7,
			"practicality": 8,
			"creativity": 5,
			"logic": 7,
			"intuition": 4,
			"experimentation": 6,
			"methodology": 8,
			"analysis": 7,
			"adaptability": 9,
			"leadership": 6,
			"communication": 8,
			"team_work": 9,
			"individual_work": 6,
			"management": 5,
			"business": 4,
			"finance": 3,
			"math": 6,
			"physics": 0,
			"chemistry": 0,
			"teaching": 4,
			"mentoring": 7,
			"masters_degree": 7,
			"doctorate_degree": 5,
			"internship": 4,
			"apprenticeship": 5,
			"hiring_potential": 8
		}
	},
	{
		"id": "a7b5a814-b571-4d8a-8fc2-9bdb7deac7e5",
    "active": false,
		"name": "Engenheiro de Hardware de Aviônicos",
		"description": "Um Engenheiro de Hardware de Aviônicos é um profissional altamente especializado que projeta, desenvolve e mantém componentes eletrônicos e sistemas de controle utilizados em aeronaves e espaçonaves. Esses sistemas incluem instrumentação, comunicação, navegação, sistemas de controle de voo, displays e outros dispositivos eletrônicos críticos para a operação segura e eficiente de aeronaves.",
		"roles": [
			{
				"name": "Sistemas de Controle de Voo",
				"description": "Projeto e manutenção dos sistemas de controle de voo que garantem a estabilidade e a segurança de aeronaves durante o voo."
			},
			{
				"name": "Comunicação por Satélite",
				"description": "Desenvolvimento de sistemas de comunicação por satélite para permitir a comunicação de voz e dados em áreas remotas e durante voos de longa distância."
			},
			{
				"name": "Sistemas de Navegação",
				"description": "Projeto de sistemas de navegação por GPS e sistemas de radar para garantir a orientação precisa de aeronaves."
			},
			{
				"name": "Instrumentação de Voo",
				"description": "Projeto de instrumentos de voo, como altímetros, velocímetros e indicadores de combustível, que fornecem informações críticas aos pilotos."
			},
			{
				"name": "Sistemas de Monitoramento de Motor",
				"description": "Desenvolvimento de sistemas de monitoramento de motores para garantir o desempenho e a segurança dos motores da aeronave."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Circuitos Eletrônicos",
				"description": "Projetar circuitos eletrônicos que são resistentes a condições extremas, como variações de temperatura, radiação e interferência eletromagnética."
			},
			{
				"name": "Seleção de Componentes",
				"description": "Escolher componentes eletrônicos adequados, como processadores, sensores, transmissores e receptores, para atender aos requisitos de desempenho e segurança."
			},
			{
				"name": "Integração de Sistemas",
				"description": "Integrar os sistemas de aviônicos com outros sistemas a bordo da aeronave, como os sistemas de controle de voo e comunicação."
			},
			{
				"name": "Conformidade Regulatória",
				"description": "Garantir que todos os sistemas de aviônicos estejam em conformidade com as regulamentações de aviação e padrões de segurança."
			},
			{
				"name": "Teste e Validação",
				"description": "Realizar testes rigorosos de laboratório e campo para garantir que os sistemas de aviônicos atendam aos padrões de segurança e desempenho."
			}
		],
		"companies": [
			{
				"name": "Boeing",
				"description": "A Boeing é uma das maiores empresas de aviação do mundo e fabricante de aeronaves comerciais e militares. Ela possui uma divisão dedicada a sistemas de aviônicos."
			},
			{
				"name": "Airbus",
				"description": "A Airbus é outra gigante da indústria aeroespacial que projeta e fabrica aeronaves comerciais e militares, bem como sistemas de aviônicos avançados."
			},
			{
				"name": "Lockheed Martin",
				"description": "A Lockheed Martin é conhecida por seus sistemas aeroespaciais e de defesa, incluindo aeronaves militares equipadas com tecnologia de ponta."
			},
			{
				"name": "Honeywell Aerospace",
				"description": "A Honeywell Aerospace oferece uma ampla gama de sistemas de aviônicos, desde sistemas de navegação até sistemas de controle de voo."
			},
			{
				"name": "Bae Systems",
				"description": "A BAE Systems é uma empresa multinacional de defesa que desenvolve sistemas de aviônicos para aeronaves militares."
			}
		],
		"params": {
			"high_level_coding": 2,
			"low_level_coding": 4,
			"backend": 2,
			"frontend": 1,
			"databases": 1,
			"data_structures": 3,
			"algorithms": 4,
			"hardware": 10,
			"software": 3,
			"infrastructure": 7,
			"design": 6,
			"ui_ux": 1,
			"mobile": 0,
			"desktop": 0,
			"web": 0,
			"tangible_results": 9,
			"abstract_results": 3,
			"theory": 10,
			"practice": 8,
			"curiosity": 9,
			"practicality": 6,
			"creativity": 4,
			"logic": 9,
			"intuition": 5,
			"experimentation": 10,
			"methodology": 8,
			"analysis": 9,
			"adaptability": 8,
			"leadership": 1,
			"communication": 4,
			"team_work": 7,
			"individual_work": 8,
			"management": 2,
			"business": 1,
			"finance": 1,
			"math": 9,
			"physics": 9,
			"chemistry": 7,
			"teaching": 2,
			"mentoring": 5,
			"masters_degree": 8,
			"doctorate_degree": 9,
			"internship": 4,
			"apprenticeship": 6,
			"hiring_potential": 7
		}
	},
	{
		"id": "b1148064-a51f-472e-9d4f-27e884846b0e",
    "active": false,
		"name": "Engenheiro de Hardware de Biomedicina",
		"description": "Um engenheiro de hardware de biomedicina é um profissional que aplica princípios da engenharia à área da medicina e da biologia. Eles trabalham no desenvolvimento e na manutenção de equipamentos médicos e dispositivos biomédicos, garantindo que esses dispositivos sejam seguros, precisos e eficazes para diagnóstico, tratamento e pesquisa médica.",
		"roles": [
			{
				"name": "Desenvolvimento de Aparelhos de Imagem Médica",
				"description": "Projetar equipamentos de ressonância magnética (RM), tomografia computadorizada (TC) e ultrassonografia para diagnóstico médico."
			},
			{
				"name": "Monitoramento de Sinais Vitais",
				"description": "Criar monitores de sinais vitais que medem parâmetros como frequência cardíaca, pressão arterial e oxigenação do sangue."
			},
			{
				"name": "Próteses Avançadas",
				"description": "Desenvolver próteses avançadas, como membros artificiais controlados por computador, para pessoas com amputações."
			},
			{
				"name": "Equipamentos de Reabilitação",
				"description": "Projetar dispositivos de reabilitação, como exoesqueletos robóticos, para auxiliar na recuperação de lesões."
			},
			{
				"name": "Sensores de Saúde Vestíveis",
				"description": "Criar sensores vestíveis para monitoramento contínuo de saúde, como dispositivos de monitoramento de glicose para diabéticos."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Dispositivos Biomédicos",
				"description": "Projetar e desenvolver dispositivos médicos, como equipamentos de diagnóstico por imagem, monitores de saúde, próteses e equipamentos de reabilitação."
			},
			{
				"name": "Desenvolvimento de Circuitos e Eletrônica",
				"description": "Projetar circuitos eletrônicos, sensores e sistemas de controle que são incorporados em dispositivos médicos."
			},
			{
				"name": "Teste e Validação",
				"description": "Realizar testes rigorosos para garantir que os dispositivos médicos atendam aos padrões de qualidade, segurança e precisão."
			},
			{
				"name": "Integração de Sensores e Software",
				"description": "Integrar sensores biomédicos e software de controle nos dispositivos para coletar e processar dados médicos."
			},
			{
				"name": "Pesquisa e Desenvolvimento",
				"description": "Trabalhar em pesquisa para criar inovações na área médica, como novas tecnologias de imagem ou dispositivos de monitoramento."
			}
		],
		"companies": [
			{
				"name": "Medtronic",
				"description": "A Medtronic é uma das maiores empresas de dispositivos médicos do mundo, com uma ampla gama de produtos, incluindo marca-passos cardíacos, dispositivos neuromoduladores e equipamentos de cirurgia."
			},
			{
				"name": "Siemens Healthineers",
				"description": "A Siemens Healthineers é conhecida por seus equipamentos de diagnóstico por imagem, como máquinas de ressonância magnética (RM) e tomografia computadorizada (TC)."
			},
			{
				"name": "Philips Healthcare",
				"description": "A Philips Healthcare fabrica equipamentos médicos avançados, como monitores de sinais vitais, dispositivos de imagem médica e equipamentos de cuidados intensivos."
			},
			{
				"name": "GE Healthcare",
				"description": "A GE Healthcare produz uma ampla variedade de dispositivos médicos, incluindo equipamentos de imagem, sistemas de monitoramento de pacientes e equipamentos de diagnóstico."
			},
			{
				"name": "Johnson & Johnson",
				"description": "A Johnson & Johnson é uma empresa farmacêutica e de dispositivos médicos que fabrica produtos que variam desde equipamentos cirúrgicos até implantes ortopédicos."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 3,
			"backend": 3,
			"frontend": 0,
			"databases": 5,
			"data_structures": 7,
			"algorithms": 6,
			"hardware": 10,
			"software": 2,
			"infrastructure": 6,
			"design": 8,
			"ui_ux": 0,
			"mobile": 2,
			"desktop": 3,
			"web": 1,
			"tangible_results": 10,
			"abstract_results": 5,
			"theory": 10,
			"practice": 8,
			"curiosity": 9,
			"practicality": 6,
			"creativity": 9,
			"logic": 9,
			"intuition": 6,
			"experimentation": 10,
			"methodology": 10,
			"analysis": 8,
			"adaptability": 9,
			"leadership": 2,
			"communication": 5,
			"team_work": 5,
			"individual_work": 8,
			"management": 3,
			"business": 1,
			"finance": 0,
			"math": 8,
			"physics": 10,
			"chemistry": 10,
			"teaching": 5,
			"mentoring": 4,
			"masters_degree": 8,
			"doctorate_degree": 7,
			"internship": 1,
			"apprenticeship": 2,
			"hiring_potential": 4
		}
	},
	{
		"id": "c6430515-022c-4e92-ac5f-950be33b3a2f",
    "active": true,
		"name": "Engenheiro de Hardware de Computadores",
		"description": "Um engenheiro de hardware de computadores é um profissional especializado em projetar, desenvolver e testar os componentes físicos de um computador, como processadores, placas-mãe, memória, discos rígidos, placas de vídeo e outros dispositivos. Eles desempenham um papel fundamental na criação dos componentes que tornam os computadores funcionais.",
		"roles": [
			{
				"name": "Desenvolvimento de CPUs e GPUs",
				"description": "Projetar processadores e unidades de processamento gráfico para computadores pessoais e servidores."
			},
			{
				"name": "Design de Placas-mãe",
				"description": "Desenvolver placas-mãe que conectam todos os componentes de um computador, incluindo CPU, memória, armazenamento e periféricos."
			},
			{
				"name": "Armazenamento de Dados",
				"description": "Desenvolver discos rígidos (HDDs), unidades de estado sólido (SSDs) e sistemas de armazenamento em rede (NAS)."
			},
			{
				"name": "Automóveis Inteligentes",
				"description": "Desenvolver hardware para sistemas de entretenimento, segurança e direção autônoma em veículos."
			},
			{
				"name": "Dispositivos Móveis",
				"description": "Projetar hardware para smartphones, tablets e outros dispositivos móveis, incluindo baterias, processadores e sensores."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Circuitos Eletrônicos",
				"description": "Criar esquemas elétricos e projetos de circuitos que permitem o funcionamento dos componentes de hardware."
			},
			{
				"name": "Desenvolvimento de Placas de Circuito Impresso (PCB)",
				"description": "Projetar placas de circuito impresso que conectam e interligam os componentes eletrônicos."
			},
			{
				"name": "Integração de Hardware e Software",
				"description": "Colaborar com engenheiros de software para garantir que o hardware seja compatível com os sistemas operacionais e software de aplicativos."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Trabalhar para melhorar o desempenho e a eficiência dos componentes de hardware."
			},
			{
				"name": "Teste e Depuração",
				"description": "Realizar testes extensivos para garantir que os componentes de hardware funcionem corretamente e solucionar problemas quando necessário."
			}
		],
		"companies": [
			{
				"name": "Intel",
				"description": "A Intel é uma das maiores fabricantes de processadores de computador e outros componentes de hardware, incluindo chipsets e unidades de estado sólido (SSDs)."
			},
			{
				"name": "AMD (Advanced Micro Devices)",
				"description": "A AMD é outra grande fabricante de processadores e placas gráficas para computadores pessoais e servidores."
			},
			{
				"name": "NVIDIA",
				"description": "A NVIDIA é líder em hardware gráfico, produzindo GPUs (Unidades de Processamento Gráfico) para jogos, aprendizado de máquina e computação de alto desempenho."
			},
			{
				"name": "Apple",
				"description": "A Apple projeta e fabrica seus próprios chips, incluindo processadores para iPhones, iPads e Macs, além de outros componentes de hardware."
			},
			{
				"name": "Qualcomm",
				"description": "A Qualcomm é conhecida por seus processadores móveis e modems usados em smartphones e dispositivos móveis."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 4,
			"backend": 5,
			"frontend": 0,
			"databases": 6,
			"data_structures": 8,
			"algorithms": 6,
			"hardware": 10,
			"software": 2,
			"infrastructure": 6,
			"design": 8,
			"ui_ux": 0,
			"mobile": 6,
			"desktop": 9,
			"web": 2,
			"tangible_results": 9,
			"abstract_results": 4,
			"theory": 9,
			"practice": 7,
			"curiosity": 7,
			"practicality": 4,
			"creativity": 8,
			"logic": 9,
			"intuition": 5,
			"experimentation": 8,
			"methodology": 9,
			"analysis": 6,
			"adaptability": 9,
			"leadership": 2,
			"communication": 5,
			"team_work": 4,
			"individual_work": 8,
			"management": 3,
			"business": 1,
			"finance": 0,
			"math": 9,
			"physics": 8,
			"chemistry": 5,
			"teaching": 5,
			"mentoring": 4,
			"masters_degree": 9,
			"doctorate_degree": 8,
			"internship": 4,
			"apprenticeship": 5,
			"hiring_potential": 6
		}
	},
	{
		"id": "930f1e98-5e78-49ce-b35a-2243edc21ff3",
    "active": false,
		"name": "Engenheiro de Hardware de Redes",
		"description": "Um engenheiro de hardware de redes é um profissional especializado em projetar, implementar e manter o hardware necessário para o funcionamento eficiente de redes de computadores. Essas redes podem variar em escala, desde redes locais (LANs) em empresas até redes de longa distância (WANs) que interconectam locais geograficamente separados. O trabalho desse engenheiro envolve garantir que os componentes físicos da rede, como roteadores, switches, cabos e outros dispositivos, estejam configurados e operando corretamente para fornecer conectividade confiável e segura.",
		"roles": [
			{
				"name": "Expansão de Rede Corporativa",
				"description": "Planejar e implementar a expansão de uma rede corporativa para acomodar um aumento no número de funcionários e dispositivos."
			},
			{
				"name": "Atualização de Infraestrutura de Data Center",
				"description": "Projetar e instalar uma nova infraestrutura de hardware de rede em um data center para melhorar o desempenho e a confiabilidade."
			},
			{
				"name": "Implantação de Redes sem Fio",
				"description": "Configurar uma rede sem fio (Wi-Fi) em um local empresarial para fornecer conectividade móvel aos funcionários e visitantes."
			},
			{
				"name": "Redes de Data Center",
				"description": "Projetar redes de data centers altamente eficientes e seguras para empresas que dependem de processamento de dados intensivo."
			},
			{
				"name": "Implantação de Redes de Voz sobre IP (VoIP)",
				"description": "Configurar uma rede que permita a transmissão de voz por IP, economizando custos em comunicações telefônicas."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Hardware de Rede",
				"description": "Projetar e dimensionar os componentes de hardware de redes com base nas necessidades específicas da organização."
			},
			{
				"name": "Instalação e Configuração",
				"description": "Instalar e configurar roteadores, switches, firewalls, servidores e outros dispositivos de rede."
			},
			{
				"name": "Segurança de Rede",
				"description": "Implementar medidas de segurança de rede para proteger os dados e as comunicações contra ameaças cibernéticas."
			},
			{
				"name": "Atualizações de Hardware",
				"description": "Gerenciar atualizações de hardware para garantir que a rede esteja atualizada com as tecnologias mais recentes."
			},
			{
				"name": "Teste e Monitoramento",
				"description": "Realizar testes de desempenho e monitorar o tráfego de rede para garantir um funcionamento eficiente."
			}
		],
		"companies": [
			{
				"name": "Cisco Systems",
				"description": "Cisco é uma das empresas líderes em equipamentos de rede, oferecendo uma ampla gama de produtos, desde roteadores e switches até soluções de segurança de rede."
			},
			{
				"name": "Juniper Networks",
				"description": "Juniper é conhecida por seus roteadores e switches de alto desempenho e soluções de rede segura."
			},
			{
				"name": "Huawei",
				"description": "A Huawei oferece uma variedade de produtos de rede, incluindo roteadores, switches e soluções de infraestrutura de telecomunicações."
			},
			{
				"name": "Fortinet",
				"description": "Fortinet é líder em segurança de rede e oferece dispositivos de firewall, dispositivos de segurança de rede e soluções de gerenciamento."
			},
			{
				"name": "Ericsson",
				"description": "Ericsson é outra grande empresa de telecomunicações que oferece soluções de infraestrutura de rede para operadoras móveis e provedores de serviços."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 4,
			"backend": 5,
			"frontend": 1,
			"databases": 6,
			"data_structures": 6,
			"algorithms": 4,
			"hardware": 10,
			"software": 2,
			"infrastructure": 10,
			"design": 6,
			"ui_ux": 0,
			"mobile": 2,
			"desktop": 4,
			"web": 6,
			"tangible_results": 10,
			"abstract_results": 4,
			"theory": 9,
			"practice": 7,
			"curiosity": 8,
			"practicality": 3,
			"creativity": 5,
			"logic": 9,
			"intuition": 3,
			"experimentation": 6,
			"methodology": 8,
			"analysis": 9,
			"adaptability": 8,
			"leadership": 2,
			"communication": 4,
			"team_work": 5,
			"individual_work": 8,
			"management": 3,
			"business": 2,
			"finance": 1,
			"math": 9,
			"physics": 7,
			"chemistry": 4,
			"teaching": 5,
			"mentoring": 4,
			"masters_degree": 5,
			"doctorate_degree": 5,
			"internship": 2,
			"apprenticeship": 5,
			"hiring_potential": 6
		}
	},
	{
		"id": "e1fcfcba-54d4-4bd2-8b80-b74a1b822b67",
    "active": false,
		"name": "Engenheiro de Hardware de Telecomunicações",
		"description": "Um engenheiro de hardware de telecomunicações é um profissional que projeta, desenvolve e mantém o hardware necessário para redes de telecomunicações, sistemas de comunicação e infraestruturas de telefonia. Esses engenheiros desempenham um papel fundamental na criação de dispositivos e equipamentos que possibilitam a transmissão eficiente de voz, dados e vídeo por meio de redes de comunicação. Seu trabalho envolve a pesquisa, projeto, teste e implementação de componentes de hardware de telecomunicações para garantir a qualidade e a confiabilidade das comunicações.",
		"roles": [
			{
				"name": "Implantação de Redes 5G",
				"description": "Participar do projeto e implementação de infraestrutura de hardware para redes 5G, que oferecem velocidades de comunicação muito mais rápidas."
			},
			{
				"name": "Infraestrutura de Rede de Data Center",
				"description": "Projetar e manter a infraestrutura de hardware de telecomunicações em data centers para garantir conectividade confiável e de alta velocidade."
			},
			{
				"name": "Redes de Fibra Óptica",
				"description": "Participar do desenvolvimento de equipamentos de hardware para redes de fibra óptica, que oferecem altas taxas de transferência de dados."
			},
			{
				"name": "Telefonia Móvel",
				"description": "Trabalhar em projetos relacionados a torres de celular, antenas e equipamentos de transmissão para melhorar a cobertura e a qualidade das redes móveis."
			},
			{
				"name": "Telecomunicações em Veículos",
				"description": "Desenvolver hardware para sistemas de comunicação em veículos, como GPS, sistemas de entretenimento e conectividade à internet."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Hardware de Comunicação",
				"description": "Projetar componentes de hardware para sistemas de comunicação, como antenas, transceptores, roteadores e switches."
			},
			{
				"name": "Desenvolvimento de Equipamentos",
				"description": "Trabalhar no desenvolvimento de equipamentos de telecomunicações, como telefones celulares, modems e dispositivos de rede."
			},
			{
				"name": "Teste e Certificação",
				"description": "Realizar testes rigorosos para garantir que os dispositivos de hardware atendam aos padrões de qualidade e segurança estabelecidos."
			},
			{
				"name": "Resolução de Problemas",
				"description": "Diagnosticar e solucionar problemas de hardware em sistemas de telecomunicações para manter a integridade das comunicações."
			},
			{
				"name": "Otimização de Redes",
				"description": "Colaborar com engenheiros de software para otimizar o desempenho de redes de comunicação e garantir uma transferência de dados eficiente."
			}
		],
		"companies": [
			{
				"name": "Ericsson",
				"description": "Ericsson é uma das maiores empresas de telecomunicações do mundo, especializada em infraestrutura de redes móveis e telecomunicações."
			},
			{
				"name": "Nokia",
				"description": "Nokia é conhecida por seus equipamentos de rede, especialmente em telecomunicações móveis e redes de fibra óptica."
			},
			{
				"name": "Huawei",
				"description": "A Huawei é uma empresa líder em equipamentos de telecomunicações e infraestrutura de rede, incluindo 5G e tecnologias de comunicação."
			},
			{
				"name": "Cisco Systems",
				"description": "Cisco é uma das principais empresas em equipamentos de rede, oferecendo soluções para redes corporativas e de data center."
			},
			{
				"name": "ZTE Corporation",
				"description": "ZTE é uma empresa global de telecomunicações que oferece produtos e soluções de rede."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 3,
			"backend": 4,
			"frontend": 1,
			"databases": 5,
			"data_structures": 5,
			"algorithms": 7,
			"hardware": 10,
			"software": 2,
			"infrastructure": 10,
			"design": 7,
			"ui_ux": 0,
			"mobile": 5,
			"desktop": 5,
			"web": 2,
			"tangible_results": 10,
			"abstract_results": 5,
			"theory": 10,
			"practice": 7,
			"curiosity": 7,
			"practicality": 4,
			"creativity": 6,
			"logic": 8,
			"intuition": 2,
			"experimentation": 8,
			"methodology": 8,
			"analysis": 8,
			"adaptability": 6,
			"leadership": 1,
			"communication": 5,
			"team_work": 8,
			"individual_work": 6,
			"management": 3,
			"business": 2,
			"finance": 0,
			"math": 8,
			"physics": 7,
			"chemistry": 3,
			"teaching": 4,
			"mentoring": 3,
			"masters_degree": 5,
			"doctorate_degree": 5,
			"internship": 2,
			"apprenticeship": 4,
			"hiring_potential": 6
		}
	},
	{
		"id": "d0d8d64c-3584-4caf-b46c-64d2612e9046",
    "active": false,
		"name": "Engenheiro de Internet das Coisas",
		"description": "Um engenheiro de Internet das Coisas (IoT) é um profissional responsável por projetar, desenvolver e implementar sistemas e dispositivos que permitem a conexão e a comunicação entre objetos físicos (como eletrodomésticos, veículos, sensores e máquinas) por meio da internet. Essa profissão está na vanguarda da revolução tecnológica, possibilitando a criação de soluções inteligentes e interconectadas para uma variedade de setores, desde a automação residencial até a indústria e a saúde.",
		"roles": [
			{
				"name": "Cidades Inteligentes",
				"description": "Desenvolver sistemas de iluminação pública inteligente que se ajustam automaticamente com base nas condições climáticas e no tráfego."
			},
			{
				"name": "Agricultura de Precisão",
				"description": "Criar sensores e dispositivos IoT para monitorar o solo, a umidade e as condições meteorológicas em fazendas, otimizando a produção agrícola."
			},
			{
				"name": "Casas Inteligentes",
				"description": "Desenvolver sistemas de automação residencial que permitem o controle de iluminação, segurança e eletrodomésticos por meio de smartphones."
			},
			{
				"name": "Veículos Autônomos",
				"description": "Contribuir para o desenvolvimento de veículos autônomos, projetando sistemas de sensores e comunicação para tornar os carros mais inteligentes e seguros."
			},
			{
				"name": "Logística e Supply Chain",
				"description": "Implementar soluções de rastreamento de mercadorias e gestão de estoque usando dispositivos IoT para otimizar cadeias de suprimentos."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Dispositivos IoT",
				"description": "Desenvolver hardware e firmware para dispositivos IoT, considerando a conectividade, sensores, eficiência energética e segurança."
			},
			{
				"name": "Desenvolvimento de Aplicações",
				"description": "Criar aplicativos e softwares que permitem o controle e a monitorização de dispositivos IoT por meio de dispositivos móveis ou computadores."
			},
			{
				"name": "Segurança IoT",
				"description": "Implementar medidas de segurança robustas para proteger dispositivos e dados contra ameaças cibernéticas."
			},
			{
				"name": "Integração de Dados",
				"description": "Configurar sistemas para coletar, transmitir e analisar dados gerados por dispositivos IoT."
			},
			{
				"name": "Redes IoT",
				"description": "Projetar e implementar redes de comunicação IoT, como LoRaWAN, Sigfox e MQTT."
			}
		],
		"companies": [
			{
				"name": "Cisco Systems",
				"description": "Cisco oferece soluções IoT abrangentes, incluindo hardware e software para redes IoT."
			},
			{
				"name": "IBM",
				"description": "A IBM é conhecida por sua plataforma Watson IoT, que fornece análise avançada e soluções de IoT para várias indústrias."
			},
			{
				"name": "Amazon Web Services (AWS)",
				"description": "A AWS oferece serviços em nuvem para IoT, permitindo que as empresas criem e gerenciem aplicativos IoT escaláveis."
			},
			{
				"name": "Intel",
				"description": "A Intel produz uma ampla gama de chips e componentes para dispositivos IoT, além de fornecer soluções de software."
			},
			{
				"name": "Oracle",
				"description": "A Oracle oferece serviços de nuvem e soluções de IoT para empresas."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 3,
			"backend": 4,
			"frontend": 1,
			"databases": 5,
			"data_structures": 5,
			"algorithms": 7,
			"hardware": 10,
			"software": 2,
			"infrastructure": 10,
			"design": 7,
			"ui_ux": 0,
			"mobile": 5,
			"desktop": 5,
			"web": 2,
			"tangible_results": 10,
			"abstract_results": 5,
			"theory": 10,
			"practice": 7,
			"curiosity": 7,
			"practicality": 4,
			"creativity": 6,
			"logic": 8,
			"intuition": 2,
			"experimentation": 8,
			"methodology": 8,
			"analysis": 8,
			"adaptability": 6,
			"leadership": 1,
			"communication": 5,
			"team_work": 8,
			"individual_work": 6,
			"management": 3,
			"business": 2,
			"finance": 0,
			"math": 8,
			"physics": 7,
			"chemistry": 3,
			"teaching": 4,
			"mentoring": 3,
			"masters_degree": 5,
			"doctorate_degree": 5,
			"internship": 2,
			"apprenticeship": 4,
			"hiring_potential": 6
		}
	},
	{
		"id": "dad0a92b-5091-4423-9db9-18114c518eb8",
    "active": false,
		"name": "Engenheiro de Machine Learning",
		"description": "Um Engenheiro de Machine Learning é um profissional que se dedica a desenvolver sistemas e aplicações de inteligência artificial (IA) e machine learning. Eles projetam, treinam e implementam algoritmos de aprendizado de máquina para resolver problemas complexos e criar soluções baseadas em dados. Essa profissão desempenha um papel crucial na criação de tecnologias que podem automatizar tarefas, tomar decisões baseadas em dados e melhorar a eficiência em diversos campos.",
		"roles": [
			{
				"name": "Recomendação de Conteúdo",
				"description": "Desenvolver sistemas de recomendação que sugerem produtos, filmes, músicas ou conteúdo personalizado com base no histórico do usuário."
			},
			{
				"name": "Detecção de Fraude",
				"description": "Criar modelos que identificam transações fraudulentas em serviços financeiros, como cartões de crédito."
			},
			{
				"name": "Processamento de Linguagem Natural (NLP)",
				"description": "Desenvolver chatbots, assistentes virtuais e sistemas de tradução automática que entendem e geram texto humano."
			},
			{
				"name": "Automação Industrial",
				"description": "Criar sistemas de controle de máquinas e robôs para otimizar processos industriais."
			},
			{
				"name": "Saúde e Medicina",
				"description": "Desenvolver modelos de diagnóstico médico que auxiliam os profissionais de saúde na identificação de doenças."
			}
		],
		"responsabilities": [
			{
				"name": "Desenvolvimento de Modelos",
				"description": "Projetar e treinar modelos de machine learning, como redes neurais, árvores de decisão e algoritmos de clustering, para resolver problemas específicos."
			},
			{
				"name": "Análise de Dados",
				"description": "Realizar análise exploratória de dados para entender os padrões e as características dos dados."
			},
			{
				"name": "Coleta e Limpeza de Dados",
				"description": "Coletar dados relevantes e prepará-los para treinamento de modelos de machine learning, incluindo limpeza e formatação."
			},
			{
				"name": "Implementação de Modelos",
				"description": "Integrar os modelos de machine learning em sistemas ou aplicativos para automatizar tarefas ou fornecer funcionalidades baseadas em IA."
			},
			{
				"name": "Treinamento de Modelos em Escala",
				"description": "Treinar modelos em grande escala usando infraestrutura de computação distribuída e GPUs."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "A Google é líder em IA e machine learning, com produtos como Google AI, TensorFlow (uma plataforma de código aberto) e assistentes virtuais como o Google Assistant."
			},
			{
				"name": "Amazon",
				"description": "A Amazon oferece serviços de machine learning por meio da Amazon Web Services (AWS), incluindo SageMaker e Comprehend para processamento de linguagem natural."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft possui a Azure Machine Learning e está envolvida em pesquisa de ponta em IA, além de aplicar IA em produtos como o Microsoft Azure e o Microsoft Office."
			},
			{
				"name": "OpenAI",
				"description": "A OpenAI é uma organização de pesquisa em IA que visa desenvolver inteligência artificial segura e avançada."
			},
			{
				"name": "NVIDIA",
				"description": "A NVIDIA fornece hardware e software para acelerar o treinamento de modelos de machine learning e IA."
			}
		],
		"params": {
			"high_level_coding": 8,
			"low_level_coding": 4,
			"backend": 10,
			"frontend": 1,
			"databases": 7,
			"data_structures": 9,
			"algorithms": 9,
			"hardware": 4,
			"software": 8,
			"infrastructure": 2,
			"design": 8,
			"ui_ux": 1,
			"mobile": 5,
			"desktop": 5,
			"web": 5,
			"tangible_results": 5,
			"abstract_results": 9,
			"theory": 9,
			"practice": 9,
			"curiosity": 9,
			"practicality": 7,
			"creativity": 6,
			"logic": 8,
			"intuition": 8,
			"experimentation": 10,
			"methodology": 9,
			"analysis": 9,
			"adaptability": 8,
			"leadership": 2,
			"communication": 5,
			"team_work": 4,
			"individual_work": 9,
			"management": 5,
			"business": 4,
			"finance": 3,
			"math": 8,
			"physics": 0,
			"chemistry": 0,
			"teaching": 5,
			"mentoring": 6,
			"masters_degree": 9,
			"doctorate_degree": 9,
			"internship": 7,
			"apprenticeship": 6,
			"hiring_potential": 8
		}
	},
	{
		"name": "Engenheiro de QA",
		"description": "Um Engenheiro de QA, ou Engenheiro de Garantia de Qualidade, é um profissional que desempenha um papel fundamental no processo de desenvolvimento de software. Sua principal responsabilidade é garantir que o software seja de alta qualidade, livre de erros e atenda aos padrões e requisitos estabelecidos pela equipe de desenvolvimento e pelos clientes. Eles desempenham um papel crítico na identificação e correção de problemas antes que o software seja lançado ou implantado.",
		"roles": [
			{
				"name": "Desenvolvimento de Aplicativos Móveis",
				"description": "Testar aplicativos móveis em diferentes dispositivos e plataformas para garantir que funcionem sem problemas."
			},
			{
				"name": "Teste de Software de Jogos",
				"description": "Realizar testes extensivos em jogos eletrônicos para garantir que eles sejam livres de bugs e ofereçam uma experiência de jogo fluida."
			},
			{
				"name": "Teste de Software Empresarial",
				"description": "Avaliar sistemas de software usados por empresas para garantir que eles atendam às necessidades de negócios e sejam confiáveis."
			},
			{
				"name": "Teste de Software de Segurança",
				"description": "Realizar testes de segurança em aplicativos e sistemas para identificar e corrigir vulnerabilidades."
			},
			{
				"name": "Implantação de Sistemas",
				"description": "Garantir que a implantação de sistemas de software em ambientes de produção seja bem-sucedida e sem interrupções."
			}
		],
		"responsabilities": [
			{
				"name": "Teste de Software",
				"description": "Projetar e executar testes em software para identificar defeitos, bugs e problemas de usabilidade."
			},
			{
				"name": "Automação de Testes",
				"description": "Desenvolver scripts e ferramentas de automação de testes para agilizar o processo de teste e garantir a consistência."
			},
			{
				"name": "Revisão de Código",
				"description": "Analisar o código-fonte para identificar possíveis problemas de qualidade, como vazamentos de memória ou violações de segurança."
			},
			{
				"name": "Documentação de Testes",
				"description": "Criar documentação detalhada de casos de teste, planos de teste e relatórios de resultados de teste."
			},
			{
				"name": "Colaboração com a Equipe de Desenvolvimento",
				"description": "Trabalhar em estreita colaboração com os desenvolvedores para entender os requisitos e solucionar problemas de qualidade."
			}
		],
		"companies": [
			{
				"name": "IBM",
				"description": "A IBM oferece uma ampla gama de serviços de teste de software, incluindo automação de testes e testes de segurança."
			},
			{
				"name": "Accenture",
				"description": "A Accenture fornece serviços abrangentes de QA, incluindo testes de aplicativos, testes de segurança cibernética e automação de testes."
			},
			{
				"name": "Capgemini",
				"description": "A Capgemini é uma empresa global de serviços de consultoria que oferece serviços de teste de software, incluindo testes de qualidade e automação."
			},
			{
				"name": "Cognizant",
				"description": "A Cognizant é uma empresa líder em serviços de tecnologia e oferece soluções de teste de software personalizadas para seus clientes."
			},
			{
				"name": "Infosys",
				"description": "A Infosys oferece serviços de teste de software, incluindo testes de aplicativos móveis, automação de testes e testes de segurança."
			}
		],
		"params": {
			"high_level_coding": 3,
			"low_level_coding": 5,
			"backend": 6,
			"frontend": 6,
			"databases": 6,
			"data_structures": 8,
			"algorithms": 9,
			"hardware": 7,
			"software": 7,
			"infrastructure": 7,
			"design": 6,
			"ui_ux": 7,
			"mobile": 6,
			"desktop": 7,
			"web": 6,
			"tangible_results": 4,
			"abstract_results": 7,
			"theory": 3,
			"practice": 7,
			"curiosity": 7,
			"practicality": 7,
			"creativity": 6,
			"logic": 9,
			"intuition": 10,
			"experimentation": 10,
			"methodology": 9,
			"analysis": 10,
			"adaptability": 8,
			"leadership": 4,
			"communication": 8,
			"team_work": 9,
			"individual_work": 6,
			"management": 6,
			"business": 4,
			"finance": 1,
			"math": 4,
			"physics": 0,
			"chemistry": 0,
			"teaching": 6,
			"mentoring": 6,
			"masters_degree": 6,
			"doctorate_degree": 4,
			"internship": 5,
			"apprenticeship": 2,
			"hiring_potential": 7
		}
	},
	{
		"id": "1ee47518-a53a-4c57-94b9-cb1623bdde1c",
    "active": false,
		"name": "Engenheiro de Robótica",
		"description": "Um engenheiro de robótica é um profissional que projeta, desenvolve e constrói sistemas robóticos autônomos ou controlados remotamente. Esses sistemas são compostos por hardware (mecânica, eletrônica e sensores) e software (algoritmos e programação) que permitem que os robôs realizem tarefas específicas. Essas tarefas podem variar desde a automação de processos industriais até a criação de robôs para exploração espacial, cirurgia assistida por robô e muito mais.",
		"roles": [
			{
				"name": "Robôs Industriais",
				"description": "Projeto e implementação de robôs para linhas de montagem automatizadas em fábricas, que podem montar produtos, realizar inspeções e manusear materiais."
			},
			{
				"name": "Robótica Médica",
				"description": "Desenvolvimento de robôs cirúrgicos para auxiliar cirurgiões em procedimentos complexos, melhorando a precisão e minimizando o risco para os pacientes."
			},
			{
				"name": "Exploração Espacial",
				"description": "Construção de robôs espaciais para explorar planetas, asteroides e outros corpos celestes, coletando dados e amostras."
			},
			{
				"name": "Robótica de Serviço",
				"description": "Criação de robôs para aplicações de serviços, como limpeza, entrega de alimentos, assistência a idosos e entretenimento."
			},
			{
				"name": "Robótica Subaquática",
				"description": "Projeto de robôs submarinos para explorar o oceano, realizar inspeções em plataformas de petróleo e gás, e estudar a vida marinha."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto Mecânico",
				"description": "Projetar a estrutura mecânica dos robôs, incluindo articulações, braços, rodas ou pernas, para garantir sua funcionalidade e eficiência."
			},
			{
				"name": "Eletrônica e Hardware",
				"description": "Desenvolver componentes eletrônicos, sensores e sistemas de controle para permitir o movimento e a interação dos robôs com o ambiente."
			},
			{
				"name": "Programação e Controle",
				"description": "Criar algoritmos e programação para controlar o comportamento e as ações dos robôs, tornando-os capazes de tomar decisões autônomas."
			},
			{
				"name": "Inteligência Artificial (IA)",
				"description": "Implementar IA para permitir que os robôs aprendam e melhorem seu desempenho com o tempo, adaptando-se a diferentes situações."
			},
			{
				"name": "Visão Computacional",
				"description": "Desenvolver sistemas de visão que permitem que os robôs percebam e interajam com o ambiente, reconhecendo objetos, pessoas e obstáculos."
			}
		],
		"companies": [
			{
				"name": "Boston Dynamics",
				"description": "Conhecida por seus robôs avançados, como o Spot e o Atlas, a Boston Dynamics trabalha em robótica móvel e autônoma."
			},
			{
				"name": "iRobot",
				"description": "A iRobot é famosa por sua linha de robôs aspiradores de pó Roomba, além de robôs de limpeza e desinfecção para uso doméstico e comercial."
			},
			{
				"name": "ROBOTIS",
				"description": "A ROBOTIS se concentra na criação de robôs educacionais e kits de robótica para fins de aprendizado e ensino."
			},
			{
				"name": "Universal Robots",
				"description": "Conhecida por seus robôs colaborativos (cobots), a Universal Robots fabrica robôs flexíveis que podem trabalhar lado a lado com humanos."
			},
			{
				"name": "KUKA Robotics",
				"description": "Especializada em robótica industrial, a KUKA projeta e fabrica robôs industriais para uma ampla gama de aplicações."
			}
		],
		"params": {
			"high_level_coding": 1,
			"low_level_coding": 4,
			"backend": 3,
			"frontend": 1,
			"databases": 5,
			"data_structures": 5,
			"algorithms": 7,
			"hardware": 10,
			"software": 2,
			"infrastructure": 5,
			"design": 8,
			"ui_ux": 0,
			"mobile": 2,
			"desktop": 3,
			"web": 0,
			"tangible_results": 10,
			"abstract_results": 3,
			"theory": 10,
			"practice": 5,
			"curiosity": 9,
			"practicality": 5,
			"creativity": 9,
			"logic": 8,
			"intuition": 5,
			"experimentation": 9,
			"methodology": 7,
			"analysis": 8,
			"adaptability": 8,
			"leadership": 1,
			"communication": 7,
			"team_work": 9,
			"individual_work": 5,
			"management": 4,
			"business": 1,
			"finance": 0,
			"math": 10,
			"physics": 8,
			"chemistry": 4,
			"teaching": 5,
			"mentoring": 4,
			"masters_degree": 8,
			"doctorate_degree": 8,
			"internship": 4,
			"apprenticeship": 6,
			"hiring_potential": 7
		}
	},
	{
		"id": "79a64d6d-ca2c-43ee-a8e6-2c9035a19cbd",
    "active": false,
		"name": "Engenheiro de Segurança de Software",
		"description": "Um Engenheiro de Segurança de Software é um profissional especializado em proteger sistemas de software contra ameaças cibernéticas, vulnerabilidades e ataques maliciosos. Sua principal responsabilidade é garantir que os aplicativos e sistemas de software sejam desenvolvidos e mantidos com medidas robustas de segurança para proteger informações sensíveis e garantir o funcionamento seguro de software em diferentes ambientes.",
		"roles": [
			{
				"name": "Segurança de Aplicativos Móveis",
				"description": "Garantir que aplicativos móveis, como aplicativos bancários ou de compras, sejam protegidos contra ameaças, como invasões e roubo de dados."
			},
			{
				"name": "Segurança de Redes Corporativas",
				"description": "Proteger redes empresariais contra ataques cibernéticos, configurando firewalls, sistemas de detecção de intrusões e políticas de acesso seguro."
			},
			{
				"name": "Segurança de Sistemas de Pagamento Online",
				"description": "Assegurar que sistemas de pagamento online sejam resistentes a fraudes e garantir que as transações financeiras sejam seguras."
			},
			{
				"name": "Segurança em Sistemas de Saúde",
				"description": "Proteger informações de pacientes em sistemas de registros médicos eletrônicos para garantir a privacidade e a integridade dos dados."
			},
			{
				"name": "Segurança em IoT (Internet das Coisas)",
				"description": "Garantir a segurança de dispositivos conectados à Internet, como câmeras de segurança e dispositivos domésticos inteligentes."
			}
		],
		"responsabilities": [
			{
				"name": "Avaliação de Riscos",
				"description": "Identificar e avaliar possíveis riscos de segurança em sistemas de software e aplicativos."
			},
			{
				"name": "Desenvolvimento Seguro",
				"description": "Implementar práticas de desenvolvimento seguro desde o início do ciclo de vida do software, incluindo codificação segura, revisões de código e testes de segurança."
			},
			{
				"name": "Testes de Penetração",
				"description": "Realizar testes de penetração para identificar vulnerabilidades e brechas de segurança em sistemas de software."
			},
			{
				"name": "Projeto de Arquitetura Segura",
				"description": "Projetar arquiteturas de software que incorporem princípios de segurança, como controle de acesso, criptografia e autenticação."
			},
			{
				"name": "Atualizações e Correções",
				"description": "Garantir que os sistemas de software estejam atualizados com correções de segurança e patches de vulnerabilidade."
			}
		],
		"companies": [
			{
				"name": "Symantec (Norton)",
				"description": "A Symantec é conhecida por seus produtos de segurança, incluindo software antivírus e soluções de segurança de endpoint."
			},
			{
				"name": "McAfee",
				"description": "A McAfee oferece uma ampla gama de produtos de segurança cibernética, incluindo soluções de antivírus, firewall e proteção de endpoint."
			},
			{
				"name": "Kaspersky Lab",
				"description": "A Kaspersky Lab é reconhecida por suas soluções de segurança de TI, incluindo antivírus, antimalware e segurança de endpoint."
			},
			{
				"name": "Fortinet",
				"description": "A Fortinet oferece soluções de segurança de rede e segurança de endpoint, incluindo firewalls e sistemas de detecção de intrusões."
			},
			{
				"name": "RSA Security",
				"description": "A RSA Security é especializada em soluções de gerenciamento de riscos e autenticação, incluindo soluções de segurança de dados."
			}
		],
		"params": {
			"high_level_coding": 2,
			"low_level_coding": 4,
			"backend": 4,
			"frontend": 1,
			"databases": 7,
			"data_structures": 7,
			"algorithms": 8,
			"hardware": 2,
			"software": 7,
			"infrastructure": 8,
			"design": 4,
			"ui_ux": 0,
			"mobile": 5,
			"desktop": 5,
			"web": 5,
			"tangible_results": 1,
			"abstract_results": 10,
			"theory": 7,
			"practice": 10,
			"curiosity": 10,
			"practicality": 4,
			"creativity": 7,
			"logic": 6,
			"intuition": 9,
			"experimentation": 10,
			"methodology": 7,
			"analysis": 9,
			"adaptability": 8,
			"leadership": 2,
			"communication": 4,
			"team_work": 4,
			"individual_work": 9,
			"management": 1,
			"business": 4,
			"finance": 3,
			"math": 5,
			"physics": 0,
			"chemistry": 0,
			"teaching": 2,
			"mentoring": 3,
			"masters_degree": 7,
			"doctorate_degree": 8,
			"internship": 5,
			"apprenticeship": 5,
			"hiring_potential": 6
		}
	},
	{
		"id": "bfd539ae-383f-414d-96c5-a6aaee8e1937",
    "active": false,
		"name": "Engenheiro de Sistemas Embarcados",
		"description": "Um engenheiro de sistemas embarcados é um profissional que projeta, desenvolve e mantém sistemas eletrônicos incorporados em dispositivos e produtos cotidianos. Esses sistemas, conhecidos como sistemas embarcados, são essenciais para o funcionamento de uma ampla variedade de dispositivos, desde eletrodomésticos e veículos até equipamentos médicos e eletrônicos de consumo. O papel do engenheiro de sistemas embarcados envolve trabalhar na interseção da eletrônica, software e hardware para criar soluções eficientes e confiáveis.",
		"roles": [
			{
				"name": "Sistemas de Controle de Veículos",
				"description": "Desenvolver sistemas embarcados para controlar funções críticas em veículos, como freios, direção e transmissão."
			},
			{
				"name": "Eletrodomésticos Inteligentes",
				"description": "Projetar a eletrônica e o firmware para eletrodomésticos conectados à Internet, como geladeiras e termostatos inteligentes."
			},
			{
				"name": "Dispositivos Médicos",
				"description": "Criar sistemas embarcados para equipamentos médicos, como monitores de pacientes, desfibriladores e bombas de infusão."
			},
			{
				"name": "Drone e Robótica",
				"description": "Desenvolver o firmware para controlar drones, robôs e sistemas de automação industrial."
			},
			{
				"name": "Dispositivos IoT",
				"description": "Projetar sistemas embarcados para dispositivos de Internet das Coisas (IoT), como sensores de casa inteligente e rastreadores de atividade."
			}
		],
		"responsabilities": [
			{
				"name": "Projeto de Hardware",
				"description": "Desenvolver a parte de hardware dos sistemas embarcados, incluindo a seleção de componentes, o layout de placas de circuito impresso (PCB) e a integração de sensores e atuadores."
			},
			{
				"name": "Programação de Firmware",
				"description": "Escrever o firmware, que é o software incorporado no sistema, para controlar o hardware e executar tarefas específicas. Isso envolve programação em linguagens como C e C++."
			},
			{
				"name": "Integração de Sensores",
				"description": "Integrar sensores, como sensores de temperatura, pressão, aceleração e câmeras, para permitir que o sistema interaja com o ambiente."
			},
			{
				"name": "Segurança",
				"description": "Implementar medidas de segurança para proteger o sistema contra ameaças cibernéticas e garantir a integridade dos dados."
			},
			{
				"name": "Otimização de Desempenho",
				"description": "Otimizar o desempenho do sistema para garantir a eficiência do uso de recursos, como energia e memória."
			}
		],
		"companies": [
			{
				"name": "Intel",
				"description": "A Intel é uma das maiores fabricantes de processadores e chips do mundo, que são amplamente utilizados em sistemas embarcados."
			},
			{
				"name": "Texas Instruments",
				"description": "A Texas Instruments projeta e fabrica semicondutores e soluções de hardware para sistemas embarcados em uma variedade de indústrias."
			},
			{
				"name": "STMicroelectronics",
				"description": "Esta empresa fornece uma ampla gama de componentes eletrônicos, incluindo sensores e microcontroladores para sistemas embarcados."
			},
			{
				"name": "NXP Semiconductors",
				"description": "A NXP oferece soluções de semicondutores para sistemas embarcados em áreas como automotiva, segurança e IoT."
			},
			{
				"name": "Microchip Technology",
				"description": "A Microchip é conhecida por seus microcontroladores e controladores lógicos programáveis (PLCs) para sistemas embarcados."
			}
		],
		"params": {
			"high_level_coding": 2,
			"low_level_coding": 7,
			"backend": 6,
			"frontend": 2,
			"databases": 6,
			"data_structures": 7,
			"algorithms": 4,
			"hardware": 10,
			"software": 7,
			"infrastructure": 4,
			"design": 6,
			"ui_ux": 1,
			"mobile": 5,
			"desktop": 8,
			"web": 2,
			"tangible_results": 7,
			"abstract_results": 7,
			"theory": 7,
			"practice": 8,
			"curiosity": 7,
			"practicality": 6,
			"creativity": 7,
			"logic": 7,
			"intuition": 6,
			"experimentation": 8,
			"methodology": 7,
			"analysis": 7,
			"adaptability": 8,
			"leadership": 1,
			"communication": 6,
			"team_work": 7,
			"individual_work": 6,
			"management": 3,
			"business": 1,
			"finance": 0,
			"math": 7,
			"physics": 6,
			"chemistry": 3,
			"teaching": 4,
			"mentoring": 4,
			"masters_degree": 7,
			"doctorate_degree": 7,
			"internship": 3,
			"apprenticeship": 5,
			"hiring_potential": 6
		}
	},
	{
		"id": "5741fd3f-b8ca-46f2-b415-17aa74091f98",
    "active": false,
		"name": "Engenheiro de Software de Redes",
		"description": "Um Engenheiro de Software de Redes é um profissional especializado em projetar, desenvolver e manter o software que controla e gerencia redes de computadores. Sua principal responsabilidade é garantir que as redes funcionem eficientemente, sejam seguras e atendam às necessidades das organizações. Eles desempenham um papel fundamental na conectividade e comunicação de dados em empresas e na Internet em geral.",
		"roles": [
			{
				"name": "Redes Definidas por Software (SDN)",
				"description": "Implementar uma infraestrutura SDN, onde o controle da rede é centralizado em software para maior flexibilidade."
			},
			{
				"name": "Redes de Data Centers",
				"description": "Projetar e gerenciar redes em data centers para suportar a computação em nuvem e serviços web."
			},
			{
				"name": "Redes de Sensores IoT",
				"description": "Desenvolver soluções de rede para dispositivos de Internet das Coisas (IoT) que se comunicam em grande escala."
			},
			{
				"name": "Redes de Telecomunicações",
				"description": "Trabalhar em sistemas de telecomunicações para garantir a conectividade confiável de telefonia e internet."
			},
			{
				"name": "Segurança de Rede Avançada",
				"description": "Implementar soluções avançadas de segurança cibernética para proteger redes empresariais contra ameaças sofisticadas."
			}
		],
		"responsabilities": [
			{
				"name": "Design de Rede",
				"description": "Planejar e projetar a arquitetura de redes de computadores, incluindo a seleção de equipamentos e tecnologias apropriados."
			},
			{
				"name": "Desenvolvimento de Protocolos",
				"description": "Criar ou aprimorar protocolos de comunicação de rede para garantir a transferência eficiente de dados."
			},
			{
				"name": "Programação de Roteadores e Switches",
				"description": "Desenvolver software de controle para roteadores, switches e dispositivos de rede para gerenciamento e otimização."
			},
			{
				"name": "Segurança de Rede",
				"description": "Implementar medidas de segurança, como firewalls, VPNs e sistemas de detecção de intrusões, para proteger a rede contra ameaças cibernéticas."
			},
			{
				"name": "Gerenciamento de Tráfego",
				"description": "Desenvolver algoritmos e políticas para gerenciar o tráfego de rede e otimizar o desempenho."
			}
		],
		"companies": [
			{
				"name": "Cisco Systems",
				"description": "A Cisco é uma das maiores empresas de tecnologia de rede do mundo, fornecendo uma ampla gama de soluções de hardware e software para redes empresariais e provedores de serviços."
			},
			{
				"name": "Juniper Networks",
				"description": "A Juniper Networks é conhecida por seus produtos de rede de alto desempenho e soluções de segurança, incluindo roteadores e switches."
			},
			{
				"name": "Huawei",
				"description": "A Huawei é uma gigante de tecnologia que oferece soluções de rede, incluindo equipamentos de telecomunicações e soluções de rede definida por software (SDN)."
			},
			{
				"name": "Nokia",
				"description": "A Nokia fornece infraestrutura de rede e serviços de telecomunicações, incluindo equipamentos para redes móveis e fixas."
			},
			{
				"name": "Ericsson",
				"description": "A Ericsson é uma líder global em tecnologia de comunicação e fornece soluções de rede, incluindo infraestrutura 5G e serviços de gerenciamento de rede."
			}
		],
		"params": {
			"high_level_coding": 4,
			"low_level_coding": 8,
			"backend": 7,
			"frontend": 1,
			"databases": 4,
			"data_structures": 6,
			"algorithms": 8,
			"hardware": 3,
			"software": 8,
			"infrastructure": 9,
			"design": 6,
			"ui_ux": 0,
			"mobile": 6,
			"desktop": 7,
			"web": 8,
			"tangible_results": 6,
			"abstract_results": 9,
			"theory": 9,
			"practice": 7,
			"curiosity": 6,
			"practicality": 8,
			"creativity": 4,
			"logic": 8,
			"intuition": 6,
			"experimentation": 7,
			"methodology": 9,
			"analysis": 9,
			"adaptability": 8,
			"leadership": 2,
			"communication": 4,
			"team_work": 4,
			"individual_work": 9,
			"management": 6,
			"business": 3,
			"finance": 2,
			"math": 5,
			"physics": 0,
			"chemistry": 0,
			"teaching": 4,
			"mentoring": 5,
			"masters_degree": 7,
			"doctorate_degree": 6,
			"internship": 6,
			"apprenticeship": 6,
			"hiring_potential": 6
		}
	},
	{
		"id": "b1988641-11c0-47e4-86ee-d7363db79a78",
    "active": false,
		"name": "Gerente de Produto de Software",
		"description": "Um gerente de produto de software é um profissional que atua como um elo crucial entre a equipe de desenvolvimento de software e os usuários finais. Eles desempenham um papel fundamental no planejamento, desenvolvimento e lançamento de produtos de software.",
		"roles": [
			{
				"name": "Desenvolvimento de Aplicativos Móveis",
				"description": "Gerenciar o desenvolvimento de um aplicativo móvel, desde a ideia inicial até o lançamento, garantindo que atenda às necessidades dos usuários e às metas de negócios."
			},
			{
				"name": "Plataformas de Comércio Eletrônico",
				"description": "Gerenciar uma plataforma de comércio eletrônico, supervisionando a adição de novos recursos, melhorando a experiência do usuário e impulsionando as vendas online."
			},
			{
				"name": "Software de Gerenciamento de Projetos",
				"description": "Coordenar o desenvolvimento de um software de gerenciamento de projetos, facilitando a colaboração da equipe e o rastreamento de tarefas."
			},
			{
				"name": "Aplicativos de Saúde Digital",
				"description": "Gerenciar o desenvolvimento de aplicativos de saúde digital que ajudam os usuários a monitorar sua saúde e bem-estar, garantindo conformidade com regulamentações médicas."
			},
			{
				"name": "Software de Análise de Dados",
				"description": "Gerenciar um software de análise de dados que auxilia empresas na tomada de decisões com base em insights de dados."
			}
		],
		"responsabilities": [
			{
				"name": "Definição de Visão e Estratégia",
				"description": "Os gerentes de produto definem a visão geral do produto, estabelecendo metas e estratégias para atingir o sucesso no mercado."
			},
			{
				"name": "Pesquisa de Mercado e Usuário",
				"description": "Eles conduzem pesquisas de mercado e coletam feedback dos usuários para entender as necessidades e preferências do público-alvo."
			},
			{
				"name": "Priorização de Recursos",
				"description": "Tomam decisões sobre quais recursos e funcionalidades devem ser desenvolvidos com base nas prioridades de negócios e nas necessidades dos usuários."
			},
			{
				"name": "Planejamento e Roadmap",
				"description": "Elaboram um plano estratégico de desenvolvimento (roadmap) que define o que será desenvolvido ao longo do tempo, levando em consideração prazos e recursos disponíveis."
			},
			{
				"name": "Comunicação com a Equipe",
				"description": "Trabalham em estreita colaboração com desenvolvedores, designers e outras equipes para garantir que o produto seja desenvolvido de acordo com as especificações."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "O Google é uma das maiores empresas de tecnologia do mundo, com uma ampla gama de produtos de software, incluindo o mecanismo de busca Google, o sistema operacional Android e aplicativos como o Gmail e o Google Maps."
			},
			{
				"name": "Apple",
				"description": "A Apple é conhecida por seus produtos de hardware, como iPhones e Macs, mas também desenvolve software, como o sistema operacional iOS e o macOS, além de aplicativos como o iTunes e o Safari."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft é uma líder em software empresarial, com produtos como o sistema operacional Windows, a suíte Office e soluções em nuvem como o Microsoft Azure."
			},
			{
				"name": "Amazon",
				"description": "A Amazon é uma gigante do comércio eletrônico, mas também oferece serviços em nuvem (Amazon Web Services - AWS) e desenvolve software para sua plataforma de e-commerce e dispositivos, como o Kindle."
			},
			{
				"name": "Atlassian",
				"description": "A Atlassian desenvolve ferramentas de software para gerenciamento de projetos e colaboração, incluindo o Jira e o Confluence."
			}
		],
		"params": {
			"high_level_coding": 2,
			"low_level_coding": 2,
			"backend": 2,
			"frontend": 2,
			"databases": 2,
			"data_structures": 2,
			"algorithms": 2,
			"hardware": 1,
			"software": 6,
			"infrastructure": 1,
			"design": 6,
			"ui_ux": 4,
			"mobile": 5,
			"desktop": 5,
			"web": 5,
			"tangible_results": 6,
			"abstract_results": 7,
			"theory": 10,
			"practice": 8,
			"curiosity": 8,
			"practicality": 10,
			"creativity": 9,
			"logic": 8,
			"intuition": 9,
			"experimentation": 8,
			"methodology": 10,
			"analysis": 10,
			"adaptability": 10,
			"leadership": 10,
			"communication": 10,
			"team_work": 10,
			"individual_work": 8,
			"management": 10,
			"business": 8,
			"finance": 7,
			"math": 3,
			"physics": 0,
			"chemistry": 0,
			"teaching": 8,
			"mentoring": 8,
			"masters_degree": 8,
			"doctorate_degree": 8,
			"internship": 5,
			"apprenticeship": 4,
			"hiring_potential": 6
		}
	},
	{
		"id": "5e686ffb-30aa-4500-b034-495b901827cd",
    "active": false,
		"name": "Gerente de Projeto de Software",
		"description": "Um gerente de projeto de software é um profissional responsável por planejar, coordenar e supervisionar todas as etapas do desenvolvimento de um projeto de software, desde a concepção até a entrega final. Eles desempenham um papel crucial na garantia de que os projetos de software sejam concluídos com sucesso, dentro do prazo e do orçamento.",
		"roles": [
			{
				"name": "Sistemas de Gestão Empresarial (ERP)",
				"description": "Coordenar a implementação de um sistema ERP em uma empresa para melhorar a eficiência e a gestão de recursos."
			},
			{
				"name": "Desenvolvimento de Aplicativos Móveis",
				"description": "Gerenciar o desenvolvimento de um aplicativo móvel, desde o planejamento inicial até o lançamento na loja de aplicativos."
			},
			{
				"name": "Desenvolvimento de Sites",
				"description": "Supervisionar o desenvolvimento de um site, garantindo que ele atenda aos requisitos do cliente e seja lançado com sucesso."
			},
			{
				"name": "Sistemas de Gerenciamento de Projetos",
				"description": "Coordenar a implementação de sistemas de gerenciamento de projetos para melhorar a eficiência da equipe."
			},
			{
				"name": "Integração de Sistemas",
				"description": "Gerenciar a integração de diferentes sistemas de software em uma organização para garantir a interoperabilidade."
			}
		],
		"responsabilities": [
			{
				"name": "Definição de Objetivos",
				"description": "Identificar os objetivos e metas do projeto de software, bem como os requisitos específicos dos clientes ou partes interessadas."
			},
			{
				"name": "Planejamento",
				"description": "Criar um plano detalhado do projeto, incluindo a alocação de recursos, cronogramas, orçamentos e marcos importantes."
			},
			{
				"name": "Comunicação",
				"description": "Manter uma comunicação eficaz entre a equipe, partes interessadas e clientes para garantir que todos estejam alinhados com os objetivos do projeto."
			},
			{
				"name": "Acompanhamento e Controle",
				"description": "Monitorar o progresso do projeto, gerenciar riscos e tomar medidas corretivas quando necessário para manter o projeto no caminho certo."
			},
			{
				"name": "Qualidade",
				"description": "Garantir que o produto final atenda aos padrões de qualidade e às expectativas do cliente."
			}
		],
		"companies": [
			{
				"name": "Google",
				"description": "O Google é uma das maiores empresas de tecnologia do mundo, desenvolvendo uma variedade de produtos de software, como o mecanismo de busca Google, o sistema operacional Android e aplicativos como o Gmail e o Google Drive."
			},
			{
				"name": "Microsoft",
				"description": "A Microsoft é uma líder em software empresarial, produzindo o sistema operacional Windows, a suíte Office e soluções em nuvem como o Microsoft Azure."
			},
			{
				"name": "Amazon",
				"description": "A Amazon é uma gigante do comércio eletrônico e também oferece serviços em nuvem (Amazon Web Services - AWS), além de desenvolver software para sua plataforma de e-commerce e dispositivos como o Kindle."
			},
			{
				"name": "Salesforce",
				"description": "A Salesforce é líder em software de gerenciamento de relacionamento com o cliente (CRM), com uma ampla gama de produtos e soluções para empresas."
			},
			{
				"name": "Oracle",
				"description": "A Oracle é especializada em software empresarial, incluindo sistemas de gerenciamento de banco de dados e soluções de negócios."
			}
		],
		"params": {
			"high_level_coding": 4,
			"low_level_coding": 3,
			"backend": 3,
			"frontend": 3,
			"databases": 3,
			"data_structures": 3,
			"algorithms": 3,
			"hardware": 2,
			"software": 8,
			"infrastructure": 1,
			"design": 6,
			"ui_ux": 4,
			"mobile": 5,
			"desktop": 5,
			"web": 5,
			"tangible_results": 5,
			"abstract_results": 6,
			"theory": 9,
			"practice": 9,
			"curiosity": 9,
			"practicality": 9,
			"creativity": 9,
			"logic": 8,
			"intuition": 9,
			"experimentation": 8,
			"methodology": 10,
			"analysis": 10,
			"adaptability": 10,
			"leadership": 10,
			"communication": 10,
			"team_work": 10,
			"individual_work": 7,
			"management": 10,
			"business": 7,
			"finance": 6,
			"math": 3,
			"physics": 0,
			"chemistry": 0,
			"teaching": 7,
			"mentoring": 7,
			"masters_degree": 8,
			"doctorate_degree": 8,
			"internship": 6,
			"apprenticeship": 5,
			"hiring_potential": 7
		}
	},
	{
		"id": "0cbc8c5d-d81b-40b9-a09a-9830d489d09e",
    "active": false,
		"name": "Pesquisador de IA",
		"description": "Um pesquisador de IA é um profissional altamente qualificado que se dedica a avançar no campo da Inteligência Artificial. Sua principal responsabilidade é realizar pesquisas, desenvolver algoritmos e modelos de aprendizado de máquina, e explorar novas técnicas para criar sistemas de IA mais inteligentes e eficazes. Esses pesquisadores estão na vanguarda da inovação tecnológica, trabalhando para resolver problemas complexos e impulsionar o desenvolvimento de aplicativos de IA em várias indústrias.",
		"roles": [
			{
				"name": "Desenvolvimento de Chatbots Inteligentes",
				"description": "Pesquisadores de IA podem trabalhar no desenvolvimento de chatbots avançados que compreendem a linguagem humana e podem responder a perguntas de forma mais precisa."
			},
			{
				"name": "Visão Computacional",
				"description": "Contribuir para a pesquisa em visão computacional para aprimorar a capacidade de sistemas de IA em reconhecer objetos, rostos e padrões em imagens e vídeos."
			},
			{
				"name": "Reconhecimento de Voz",
				"description": "Pesquisar e desenvolver algoritmos de reconhecimento de voz para assistentes de voz e sistemas de transcrição automática."
			},
			{
				"name": "Carros Autônomos",
				"description": "Contribuir para a pesquisa em sistemas de direção autônoma, incluindo percepção de ambiente, tomada de decisão e controle."
			},
			{
				"name": "Tradução Automática",
				"description": "Melhorar algoritmos de tradução automática para permitir a tradução mais precisa de idiomas."
			}
		],
		"responsabilities": [
			{
				"name": "Pesquisa e Desenvolvimento",
				"description": "Conduzir pesquisas científicas para criar algoritmos e modelos de IA avançados."
			},
			{
				"name": "Desenvolvimento de Algoritmos",
				"description": "Projetar algoritmos de aprendizado de máquina e técnicas de processamento de dados para melhorar o desempenho de sistemas de IA."
			},
			{
				"name": "Coleta e Análise de Dados",
				"description": "Coletar e analisar grandes conjuntos de dados para treinar modelos de IA e validar resultados."
			},
			{
				"name": "Experimentação",
				"description": "Realizar experimentos para testar novas abordagens e ideias em IA."
			},
			{
				"name": "Treinamento de Modelos de IA",
				"description": "Treinar modelos de IA usando técnicas de aprendizado de máquina supervisionado e não supervisionado."
			}
		],
		"companies": [
			{
				"name": "OpenAI",
				"description": "A OpenAI é uma organização de pesquisa de IA focada em desenvolver tecnologias de IA avançadas e éticas. Além de desenvolver IA avançada, a OpenAI realiza pesquisas para garantir que a IA seja segura e benéfica para a humanidade."
			},
			{
				"name": "DeepMind",
				"description": "Uma empresa de pesquisa em IA pertencente à Alphabet (empresa-mãe do Google) que se concentra em resolver problemas complexos de IA."
			},
			{
				"name": "Google AI",
				"description": "O Google tem uma divisão de pesquisa em IA dedicada a avançar na inteligência artificial e aplicá-la em produtos e serviços."
			},
			{
				"name": "Microsoft Research AI",
				"description": "A Microsoft possui uma divisão de pesquisa em IA que trabalha em projetos inovadores de IA e aprendizado de máquina."
			},
			{
				"name": "NVIDIA",
				"description": "A NVIDIA é conhecida por seus avanços em hardware de IA, mas também está envolvida em pesquisa em IA."
			}
		],
		"params": {
			"high_level_coding": 7,
			"low_level_coding": 6,
			"backend": 4,
			"frontend": 1,
			"databases": 7,
			"data_structures": 8,
			"algorithms": 10,
			"hardware": 3,
			"software": 8,
			"infrastructure": 1,
			"design": 8,
			"ui_ux": 1,
			"mobile": 3,
			"desktop": 5,
			"web": 4,
			"tangible_results": 3,
			"abstract_results": 9,
			"theory": 9,
			"practice": 6,
			"curiosity": 9,
			"practicality": 5,
			"creativity": 8,
			"logic": 9,
			"intuition": 5,
			"experimentation": 10,
			"methodology": 10,
			"analysis": 10,
			"adaptability": 8,
			"leadership": 3,
			"communication": 5,
			"team_work": 6,
			"individual_work": 8,
			"management": 4,
			"business": 3,
			"finance": 2,
			"math": 9,
			"physics": 0,
			"chemistry": 0,
			"teaching": 7,
			"mentoring": 7,
			"masters_degree": 10,
			"doctorate_degree": 10,
			"internship": 4,
			"apprenticeship": 6,
			"hiring_potential": 7
		}
	},
	{
		"id": "54d6d7cc-08b4-44e7-93aa-ca089cda89f4",
    "active": false,
		"name": "Técnico de Data Centers",
		"description": "Um Técnico de Data Centers é um profissional responsável por operar, manter e garantir o funcionamento eficiente de um data center, que é um ambiente crítico onde servidores, armazenamento de dados e equipamentos de rede são alojados. A principal função deste profissional é assegurar que todos os sistemas e equipamentos do data center estejam em pleno funcionamento, minimizar interrupções e garantir a segurança e o resfriamento adequado do ambiente.",
		"roles": [
			{
				"name": "Atualização de Equipamentos",
				"description": "Planejar e executar a substituição de servidores mais antigos por novos equipamentos para melhorar o desempenho e a eficiência do data center."
			},
			{
				"name": "Expansão do Data Center",
				"description": "Projetar e implementar a expansão física do data center para acomodar mais servidores e armazenamento conforme a demanda de negócios aumenta."
			},
			{
				"name": "Melhorias na Eficiência Energética",
				"description": "Identificar e implementar medidas para reduzir o consumo de energia no data center, como a adoção de sistemas de resfriamento mais eficientes."
			},
			{
				"name": "Atualização de Segurança Física",
				"description": "Avaliar e atualizar as medidas de segurança física do data center para garantir que ele esteja protegido contra ameaças externas."
			},
			{
				"name": "Implementação de Backup e Recuperação",
				"description": "Desenvolver e testar estratégias de backup e recuperação de dados para garantir a continuidade dos negócios em caso de falha."
			}
		],
		"responsabilities": [
			{
				"name": "Monitoramento e Manutenção",
				"description": "Realizar monitoramento constante dos sistemas, servidores e equipamentos do data center para garantir que tudo esteja funcionando corretamente. Realizar manutenção preventiva e corretiva quando necessário."
			},
			{
				"name": "Gerenciamento de Energia",
				"description": "Garantir o fornecimento ininterrupto de energia para os equipamentos do data center, incluindo a manutenção de sistemas de energia de backup, como UPS (Fonte de Alimentação Ininterrupta) e geradores."
			},
			{
				"name": "Segurança Física",
				"description": "Implementar medidas de segurança física, como controle de acesso, câmeras de segurança e detecção de incêndio, para proteger os ativos do data center."
			},
			{
				"name": "Backup e Recuperação de Dados",
				"description": "Implementar estratégias de backup e recuperação de dados para garantir que os dados críticos sejam protegidos e possam ser restaurados em caso de falha."
			},
			{
				"name": "Suporte a Servidores e Redes",
				"description": "Prestar suporte técnico a servidores, switches, roteadores e outros equipamentos de rede presentes no data center."
			}
		],
		"companies": [
			{
				"name": "Equinix",
				"description": "A Equinix é uma das maiores empresas de data centers do mundo, oferecendo serviços de colocation e interconexão em data centers estratégicos em todo o mundo."
			},
			{
				"name": "Digital Realty",
				"description": "A Digital Realty é uma provedora global de infraestrutura de data center, oferecendo uma ampla gama de soluções de colocation e interconexão."
			},
			{
				"name": "CyrusOne",
				"description": "A CyrusOne opera data centers em várias regiões dos Estados Unidos, fornecendo serviços de colocation e gerenciamento de data centers."
			},
			{
				"name": "Rackspace Technology",
				"description": "A Rackspace fornece serviços de gerenciamento de data centers e hospedagem em nuvem, ajudando empresas a otimizar sua infraestrutura de TI."
			},
			{
				"name": "Iron Mountain Data Centers",
				"description": "A Iron Mountain oferece serviços de data center seguros e sustentáveis, com um foco especial na gestão de dados sensíveis."
			}
		],
		"params": {
			"high_level_coding": 3,
			"low_level_coding": 5,
			"backend": 5,
			"frontend": 0,
			"databases": 10,
			"data_structures": 9,
			"algorithms": 6,
			"hardware": 10,
			"software": 5,
			"infrastructure": 8,
			"design": 7,
			"ui_ux": 0,
			"mobile": 2,
			"desktop": 5,
			"web": 2,
			"tangible_results": 8,
			"abstract_results": 7,
			"theory": 6,
			"practice": 8,
			"curiosity": 4,
			"practicality": 7,
			"creativity": 6,
			"logic": 8,
			"intuition": 7,
			"experimentation": 4,
			"methodology": 8,
			"analysis": 9,
			"adaptability": 9,
			"leadership": 1,
			"communication": 3,
			"team_work": 7,
			"individual_work": 6,
			"management": 6,
			"business": 5,
			"finance": 1,
			"math": 5,
			"physics": 4,
			"chemistry": 2,
			"teaching": 2,
			"mentoring": 3,
			"masters_degree": 7,
			"doctorate_degree": 2,
			"internship": 3,
			"apprenticeship": 3,
			"hiring_potential": 3
		}
	},
	{
		"id": "e750a9b9-0b77-4508-b973-d863155563e5",
    "active": true,
		"name": "Técnico de Redes",
		"description": "Um técnico de redes é um profissional especializado em configurar, manter e solucionar problemas em redes de computadores. Essas redes podem variar de pequenas redes locais em residências e empresas até redes empresariais complexas que abrangem múltiplos locais. A principal responsabilidade de um técnico de redes é garantir que os dispositivos de rede funcionem corretamente e que os usuários possam se conectar e compartilhar informações de maneira eficaz e segura.",
		"creations": [
			{
				"name": "Implantação de Redes Empresariais",
				"description": "Configurar e implantar redes de computadores para empresas, garantindo que todos os dispositivos estejam conectados e funcionando corretamente."
			},
			{
				"name": "Atualização de Infraestrutura de Rede",
				"description": "Atualizar e modernizar a infraestrutura de rede, substituindo equipamentos mais antigos por tecnologia mais recente e eficiente."
			},
			{
				"name": "Solução de Problemas de Conectividade",
				"description": "Diagnosticar e resolver problemas de conectividade, como problemas de Wi-Fi, para garantir que os usuários tenham acesso confiável à Internet."
			},
			{
				"name": "Configuração de Redes Domésticas",
				"description": "Configurar redes domésticas para proporcionar conectividade estável e segura para famílias e indivíduos."
			},
			{
				"name": "Recuperação de Desastres de Rede",
				"description": "Desenvolver planos de recuperação de desastres para garantir que a rede possa ser restaurada rapidamente em caso de falhas."
			}
		],
		"responsibilities": [
			{
				"name": "Instalação de Hardware de Rede",
				"description": "Configurar e instalar dispositivos de rede, como roteadores, switches e firewalls, garantindo que estejam conectados corretamente."
			},
			{
				"name": "Configuração de Redes",
				"description": "Configurar endereços IP, máscaras de sub-rede e outros parâmetros de rede para garantir a comunicação adequada entre dispositivos."
			},
			{
				"name": "Manutenção Preventiva",
				"description": "Realizar manutenção regular, como atualizações de firmware e verificação de cabos, para garantir o funcionamento contínuo da rede."
			},
			{
				"name": "Resolução de Problemas",
				"description": "Diagnosticar e solucionar problemas de rede, como perda de conexão à Internet, lentidão na rede e problemas de conectividade."
			},
			{
				"name": "Segurança de Rede",
				"description": "Implementar medidas de segurança, como firewalls e sistemas de detecção de intrusões, para proteger a rede contra ameaças cibernéticas."
			}
		],
		"companies": [
			{
				"name": "Cisco Systems",
				"description": "A Cisco é uma das maiores empresas do mundo no setor de redes e é conhecida por seus equipamentos de rede, como roteadores e switches."
			},
			{
				"name": "Juniper Networks",
				"description": "A Juniper é especializada em soluções de rede de alto desempenho, incluindo roteadores, switches e dispositivos de segurança."
			},
			{
				"name": "Fortinet",
				"description": "A Fortinet é líder em segurança de rede e oferece uma variedade de produtos, incluindo firewalls e sistemas de detecção de intrusões."
			},
			{
				"name": "Netgear",
				"description": "A Netgear é conhecida por seus produtos de rede doméstica e de pequenas empresas, como roteadores e switches."
			},
			{
				"name": "D-Link",
				"description": "A D-Link é outra empresa que produz equipamentos de rede, incluindo roteadores, switches e câmeras de segurança."
			}
		],
		"params": {
			"high_level_coding": 4,
			"low_level_coding": 5,
			"backend": 5,
			"frontend": 1,
			"databases": 5,
			"data_structures": 4,
			"algorithms": 4,
			"hardware": 8,
			"software": 5,
			"infrastructure": 10,
			"design": 5,
			"ui_ux": 0,
			"mobile": 5,
			"desktop": 6,
			"web": 8,
			"tangible_results": 8,
			"abstract_results": 6,
			"theory": 8,
			"practice": 7,
			"curiosity": 6,
			"practicality": 7,
			"creativity": 5,
			"logic": 8,
			"intuition": 7,
			"experimentation": 8,
			"methodology": 8,
			"analysis": 9,
			"adaptability": 9,
			"leadership": 1,
			"communication": 7,
			"team_work": 8,
			"individual_work": 6,
			"management": 4,
			"business": 1,
			"finance": 2,
			"math": 6,
			"physics": 6,
			"chemistry": 4,
			"teaching": 4,
			"mentoring": 3,
			"masters_degree": 3,
			"doctorate_degree": 1,
			"internship": 3,
			"apprenticeship": 3,
			"hiring_potential": 6
		}
	}
]